{"date":"Aug 27, 2020, 9:00 p.m. ET","exchange":"NASDAQ: BILI","q":"2020-Q2","ticker":"BILI","transcript":"Prepared Remarks:\nOperator\nGood day, and welcome to the Bilibili 2020 Second Quarter Earnings Conference Call. Today's conference is being recorded.\nAt this time, I would like to turn the conference over to Juliet Yang, Senior Director of Investor Relations. Please go ahead.\nJuliet Yang -- Senior Director of Investor Relations\nThank you, operator.\nPlease note the discussion today will contain forward-looking statements relating to the Company's future performance, and are intended to qualify for the Safe Harbor from liability, as established by the US Private Securities Litigation Reform Act. Such statements are not guarantees of future performance and are subject to certain risks and uncertainties, assumptions and other factors. Some of these risks are beyond the Company's control and could cause actual results to differ materially from those mentioned in today's press release and this discussion. A general discussion of the risk factors that could affect Bilibili's business and financial results is included in certain filings of the Company with the Securities and Exchange Commission. The Company does not undertake any obligation to update this forward-looking information, except as required by law.\nDuring today's call, management will also discuss certain non-GAAP financial measures, for comparison purposes only. For a definition of non-GAAP financial measures and the reconciliation of GAAP to non-GAAP financial results, please see the 2020 second quarter financial results news release issued earlier today.\nAs a reminder, this conference call is being recorded. In addition, an investor presentation and a webcast replay of this conference call will be available on the Bilibili investor relations website at ir.bilibili.com.\nJoining us today on the call from Bilibili's senior management are Mr. Rui Chen, Chairman of the Board and Chief Executive Officer; Ms. Carly Lee, Vice Chairwoman of the Board and Chief Operating Officer; and Mr. Sam Fan, Chief Financial Officer.\nAnd I will now turn the call over to Mr. Fan, who will read the prepared remarks on behalf of Mr. Chen.\nXin Fan -- Chief Financial Officer\nThank you, Juliet, and thank you, everyone, for participating in our 2020 second quarter conference call. I'm pleased to deliver today's opening remarks on behalf of Mr. Chen.\nThe second quarter was another strong quarter of growth for Bilibili. Owing to our increasing diverse content and wider awareness of our brand, we are reaching a much broader audience. For the second quarter, MAUs were 172 million, up 55% and DAUs were up 52% to 51 million, both on a year-over-year basis. Mobile MAUs continued to be our fastest grower, reaching 153 million in the period, up 59% compared to the same period in 2019.\nAlong with the expanded user base, user engagement continues to be strong. In the second quarter, our users spent an average of 79 minutes per day on our Bilibili app, making us one of the most popular platforms among our peers. As we move into our peak summer season, with solid execution of our initiatives, we're looking forward to further building on our user growth momentum.\nWe continue to rollout more premium content and services, strengthen our monetization capabilities, and we are increasingly converting traffic to paid users. Our MPUs were up 105% year-over-year, reaching 12.9 million in the second quarter, and our paying ratio improved to 7.5%, compared to 5.7% from the same period last year. These increases fueled our top line growth and we once again reached record high revenues of RMB2.6 billion, beating the high-end of our guidance.\nOur gross margin expanded to 23% from 16% in the second quarter of last year as we continued to realize more operating leverage.\nWe remain committed to our user growth focused strategy. After 11 years of cultivation, we believe our content pool is deep and diverse enough to accommodate a much larger user base, and our community is friendly and robust enough to retain those newcomers. Hence, we have made more proactive user growth plans. Our primary areas of focus are on creating additional brand awareness and targeted channel acquisition. In the second quarter, we launched a series of campaigns aimed at spreading the Bilibili brand name among a broader audience, in tandem with expanding our content appeal to a mass market. During our 11th anniversary, we introduced a new slogan Bilibili-All the Videos You Like, helping to define our brand proposition and appeal to a wider base. With this vision in mind, we launched a branding campaign series that started with our blockbuster New Year's Eve gala in the first quarter, followed by the Hou Lang, Ru Hai, Xi Xiang Feng trilogy videos, which all have been widely successful, and we are seeing a clear uptick in brand perception and brand awareness across different demographics. This strategy is working well for us and we are determined to carry on as we move into the summer peak season.\nLooking ahead, a number of positive industry trends are working in our favor. The adoption of a faster network and smarter hardware is making content creation easier and more accessible to everyone. Particularly, the video industry is emerging as the biggest beneficiary. Video is rapidly becoming the most interactive and influential method to convey information. Building on a decade of experience and leadership in the video community, we are well positioned to capture the growth opportunity.\nWith that overview, I would like to walk through the latest updates of our content, community, commercialization and strategic growth plans. First, our content. Our PUGV ecosystem remains the cornerstone of our business. For the past decade, we have carefully cultivated our PUGV community, and risen as the clear industry leader. Our effective traffic distribution mechanism and friendly community environment make Bilibili an increasingly attractive platform for content creators. In addition to easy-to-use tools that make the content creation process simpler and more accessible, we launched our new ad platform to bring more commercial opportunities to our content creators. For the second quarter, we had approximately 1.9 million content creators uploading 6 million videos per month, representing increases of 123% and 148%, respectively, both year-over-year.\nFor the second quarter, our most heavily trafficked verticals were lifestyle, game, entertainment, animation and tech and knowledge. With rapid trends in video content, newcomers and key opinion leaders from other platforms are turning to Bilibili. In the first half of 2020, the number of content creators who submitted their first video creation trial grew by 139% year-over-year. These creative minds open Bilibili up to expanded content categories. For instance, we officially launched a knowledge sector to encourage content creators to share their insights, such as business stories, how-to skills and professional experiences. With our effective operational campaigns and welcoming community atmosphere, knowledge has quickly become the fastest growing sector and we have ever seen -- we have seen excellent traction.\nTurning to our OGV. We remain as the dominant leader in the animation field with one of China's largest anime libraries. Since beginning of this year, there were three new Chinese animes joined our 100 million video views club, including White Cat Legend, Da Li Si Rizhi, and our self-produced The Daily Life of the Immortal King, Xian Wang de Richang Shenghuo, and Carp Reborn, Yuan Long. Additionally, we plan to rollout more Bilibili-produced Chinese animes, including Ling Cage, Ling Long, A Mortal's Journey, [Foreign Speech] and The Legend of Tang [Foreign Speech]. We believe these new series will attract even more Chinese anime lovers to our platform in this summer.\nAs a supplement to our vast content library, we expanded variety shows and documentaries continued to resonate with fans and provide good advertising avenues to our business partners. In August, we were excited to introduce our very first self-produced music variety show Rap for Youth [Foreign Speech], sponsored by Alibaba's Juhuasuan. We hope this rap-themed talent show will help further expand our content offerings, while inspiring our content creators and young generations alike.\nIn the documentary department, we are pleased to have received wide recognition, not only from our users, but also professional institutions. Two of our Bilibili-produced documentaries were nominated by Bai Yu Lan for the Best Documentary Award, including And Yet the Books [Foreign Speech] and Police Stories [Foreign Speech]. The Hidden Kingdoms of China, a documentary that we co-produced with National Geographic, was nominated as the Best Limited Series-Long Form documentary by Jackson Wild Media Award.\nTurning to our community. Our community size and engagement have been accelerating rapidly. Our platform is more robust than ever, and we are seeing record highs across all of our primary engagement metrics. In the second quarter, our daily video views reached 1.2 billion, up 97% year-over-year. And our users generated nearly 5.2 billion monthly interactions through bullet chats, comments, likes and Bilibili moment posts, nearly three times the amount from the same period in 2019.\nOur official membership program is on a similar growth track. By the end of the second quarter, we had 89 million official members who passed our 100-question exam, up 65% year-over-year. Retention for this group remains well above 80%, demonstrating the loyalty of our users.\nTurning to our commercialization progress, I will first review the status of our game business. Revenues from our mobile games business were up 36% year-over-year to RMB1.2 billion, accounting for 48% of our total revenues. Building on our massive and expanding gamer community, our distribution power in the ACG sector is becoming even stronger. In the second quarter, we were excited to add the new blockbuster title Princess Connect! [Foreign Speech] to our game portfolio. This exclusively licensed Japanese RPG was an instant hit after its release in April, and topped China's iOS download and grossing charts multiple times. Our legacy title Fate Grand Order, or FGO, continues to hold a considerable draw for its stable fan base. At the end of June, we were excited to celebrate Azur Lane's three-year anniversary with a major content update and accompanying offline activities. The long life cycles of these games continues to be a strong testimony to our ability to operate and sustain high quality games.\nLooking at our game pipeline. Currently, we have 11 games that have acquired approvals and are scheduled to be released in the coming months. These include Magia Record, [Foreign Speech], a highly anticipated ACG title adapted by a popular Japanese anime, and Sword Art Online, [Foreign Speech], an exciting MMORPG. Additionally, while strengthening our ACG game operation, we continue to expand offerings in high-quality games. At the end of June -- July, we hosted our first-ever game release event Enter Your Fantasy World, where we introduced 11 exciting titles across different genres. These included simulation game Dark Boom, [Foreign Speech], a self-developed ACG game; [Foreign Speech], a highly anticipated title adapted from our self-owned Chinese anime IP; and, several high-quality ACG titles, [Foreign Speech] and [Foreign Speech]. In August, we are delighted to announce we are going to bring Chinese audiences the mobile version of Fall Guys, [Foreign Speech], an exciting casual Battle Royale game.\nAs we solidify our game-related content offerings and welcome more game lovers to our platform, Bilibili has become the go-to place for joint operating partners. In the second half of the year, we will continue to work with leading game developers to bring our users premium games such as Mihoyo's Genshin Impact and NetEase's Harry Potter.\nTurning to our VAS business. Revenues from VAS increased by 153% year-over-year, reaching RMB825 million in the second quarter. Our growth was mainly driven by increased contribution from premium memberships, live broadcasting and other value-added services. We continued to enrich our live broadcasting content and increase the penetration among our growing traffic. As our platform becomes more influential in China's online entertainment industry, we have seen more hosts and talent agencies turning to Bilibili to grow their fan base and maximize their commercial potential.\nOn the e-sports front, our three-year strategic partnership with Riot Games will significantly enhance our position in this area. We will join forces with Riot Games and the local government to host diversified online and offline activities to promote world-renowned League of Legends World Championship events, while bringing more e-sports lovers to Bilibili.\nOur premium memberships, which offer additional exclusive or advanced content to paid users, continued to flourish in the second quarter. By the end of June, we had 10.5 million premium members, up 100% year-over-year. These members represent the golden cohort of our most loyal users, who are also the most primed for future cross-selling opportunities. Notably, our comic business is also on the rise. Within two years, Bilibili Comic has grown from scratch to top three comic platforms in China, with over 1 million paid subscribers. As a natural extension from our core ACG content offering, we see great synergy between our main app and Bilibili Comic app with significant room to grow.\nAs for our advertising business, our growing user base and increased brand awareness make Bilibili a must go-to platform for advertisers. Despite the tough macro economic environment, we grew our advertising business to RMB349 million, up 108% year-over-year and continued to broaden our customer base. The leading industry verticals in the period were games, e-commerce, 3C products, food and beverage and education.\nIn summary, we had another strong quarter of growth and we are well poised to continue on this trajectory. Building on the positive momentum in the first half of this year, we plan to make additional investments in branding and channels in the coming quarters to further drive user growth and raise brand awareness. We believe these investments will boost our self-fulfilling growth cycle and yield considerable return in the long run. As we reach new heights, our focus will remain on the quality of growth and we will continue to closely monitor the ROI of our marketing expenses. We are confident that our effective strategic initiatives will further fuel our user growth and support our top line expansion as we continue to build value for our Company, investors and growing community of users.\nThis concludes Mr. Chen's remarks. I will now provide a brief overview of our financial results for the second quarter of 2020.\nOur total net revenues increased by 70% year-over-year to RMB2.6 billion, exceeding the high end of our guidance. With our games accounting for just under half of our total revenues, we are pleased to -- with the commercialization progress of our non-game offerings and our ability to convert our online traffic into paying users. The average number of monthly paying users increased by 105% year-over-year, reaching 12.9 million in the second quarter.\nCost of revenues increased by 57% year-over-year to RMB2 billion. Revenue-sharing cost, a key component of cost of revenues, was RMB1 billion, a 79% increase from the same period in 2019.\nGross profit increased by 140% year-over-year to RMB604 million. We are also starting to see operating leverage from our diversified revenue streams. With more revenue contribution from our higher margin business, as well as additional income from paying users, our gross profit margin continued to improve, reaching 23% in the second quarter.\nTotal operating expenses increased to RMB1.2 billion, up 103% from the same period in 2019.\nSelling and marketing expenses were RMB675 million, representing a 181% increase year-over-year. The increase was primarily attributable to the increased channel and marketing expenses associated with Bilibili's app and brand, as well as expenses for the Company's mobile games and selling and marketing personnel.\nG&A expenses were RMB208 million, representing a 48% increase year-over-year. The increase was primarily due to increased headcount in G&A personnel and increased share-based compensation expenses.\nR&D expenses were RMB331 million, representing a 53% increase year-over-year. The increase was primarily due to increased headcount in research and development personnel and increased share-based compensation expenses.\nNet loss was RMB571 million for the second quarter of 2020, compared to RMB315 million in the same period of 2019. Adjusted net loss, which is a non-GAAP measure that excludes share-based compensation expenses and amortization expense related to intangible assets acquired through business acquisitions, was RMB476 million, compared to RMB256 million in the same period of 2019.\nBasic and diluted net loss per share were RMB1.63. Adjusted basic and diluted net loss per share were RMB1.35.\nAs of June 30, 2020, we had cash and cash equivalents, time deposits, as well as short-term investments of RMB15.6 billion, or $2.2 billion, compared to RMB8.1 billion as of December 31, 2019.\nFor the third quarter of 2020, we are currently projecting net revenues to be between RMB3.05 billion and RMB3.10 billion.\nThank you for your attention. We would like now to open the call to your questions. Operator, please go ahead.\nQuestions and Answers:\nOperator\nThank you, sir. [Operator Instructions] Your first question in queue comes from the line of Alex Poon from Morgan Stanley. Alex, please ask your question. Your line is open.\nAlex Poon -- Morgan Stanley -- Analyst\n[Foreign Speech] My first question is regarding the user growth. First half, the user growth is very strong. May I know -- can you share with us the quality and retention and the user profile of the new user growth in first half and about the second half growth and also next year, what is the key focuses of your strategy of user growth? How are you going to balance the user retention and maintain the fast user growth in second half of next year? Thank you very much.\nRui Chen -- Chairman and Chief Executive Officer\n[Foreign Speech] I will translate for Mr. Chen. Last year, we have reinforced and reaffirmed user growth will be our key strategic focus and we have been carrying out the strategy efficiently going through the first half of this year, and have made very positive progress.\nAs for the new user profile you asked, there is no significant change of the new user profile, we still see a lot of new young generations that are coming in. The average age of our new user is about 20 years old. However, we would like to emphasize during the user growth process, we're more focused on the quality over quantity, and the quality of our users can be supported by the daily time spend, daily time spend of 79 minutes per day. And our user engagement were up to 5.2 billion on a monthly basis, and our daily video views reached 1.2 billion. So, all of these numbers supported our users are not growing very -- not only growing very fast, their quality are very, very high.\n[Foreign Speech] And notably, we've noticed that the new user who come in during the first half of 2020 and also paid for our services within the same period, the ratio has significantly increased compared to the same period last year. And also the new users who came on our platform during 2017, 2018 and 2019 who also stayed and paid for the next few years, their paying ratio is also increasing. So, once again, the -- this set of numbers is a strong testimony of the quality of our new user growth.\n[Foreign Speech] So here we also wanted to emphasize the methodology of our user growth. The reason why we are very confident in the user growth trajectory is based on the concept that we have been really emphasizing that we use our content to attract user and use our community to retain users. And as you may notice in the first half of this year, we've done some significant progress to allow our content to reach a much broader audiences. And this type of user growth cannot be achieved by purely channel acquisition or user acquisition. If a user comes to our platform simply through the channel acquisition, we cannot retain them if there's no good content. And the key strategy is to allow our content to grow to a much broader category, and this opens up to new -- for us to new demographics.\n[Foreign Speech] And Bilibili is a community with high engagement level and high retention level. Although our users increased significantly, our overall community maintains the same intensity and continues to be very sticky and with high retention rate.\n[Foreign Speech] I'll update you the schedule of our user growth plan. So everybody know during Q1, the pandemic period, people have more time in their hands, so that gives us very good window to invest in user growth. And the second quarter, as people are going back to work and return to school, it came to a more stabilized period that we'll be focusing on raising our retention and converting those users to pay users. And notably, we've also made very good progress to raise our brand awareness in the second quarter and achieve pretty good results. And in the Q3 is traditionally strong peak season for us, so that we plan to make additional investment in both brand, as well as channel acquisition.\n[Foreign Speech] I would also update you with our brand -- branding campaigns. In the second quarter, starting from May, we have made a very successful marketing campaign trilogy profits with Hou Lang, Ru Hai and Xi Xiang Feng, and we believe this series of campaigns as a complete marketing event, which we consider to be the most successful branding campaign among Chinese Internet companies during the second quarter.\n[Foreign Speech] This proves our ability to not only to do amazing events among young generation, but we also have the ability to touch much wider, broader audiences.\n[Foreign Speech] And the reason why we want to emphasize on branding campaign is based on our business model, we use content to attract user and community to retain user. As our content continues to evolve to reach broader audiences, one important step, too, is to allow more people to know that Bilibili have so much content to offer, which are in line with our new brand slogan Bilibili-All the Videos You Like.\n[Foreign Speech] Okay. As far as our Q3 user outlook, we believe we'll reach historical highs during this quarter. And this summer is a little bit special because in July, a majority of the students are still in school, and August is a full month of summer vacation, and September will be the period where students are returning to school. So, in August, we believe we are able to achieve a pretty high MAU target, and on quarterly, monthly average basis we believe we can reach historical high.\n[Foreign Speech] So, on a single month basis, we believe we can achieve over 200 million MAU target during Q3, on a single month basis.\nCarly Lee -- Vice Chairwoman and Chief Operating Officer\n[Foreign Speech] Carly would like to supplement a few points. During our brand upgrade campaign this year, our overall brand exposure has achieved over 5 billion times. And the brand recognition level among -- just among the age brackets in between 17 to 35 has raised to 80% -- I'm sorry, 60%. And in the second half, our main focus will be on to convert people from recognizing Bilibili brand to turning to Bilibili users. And we -- during the second half, the marketing campaign were [Phonetic] surrounded our key activity around the key time slots, such as the summer vacation and returning to school, as well as the League of Legends World Championship and our New Year's Eve Gala and many work-like scenario among young generation and to create new content, new brand campaigns and further drive our user growth.\nOperator\nOur next question comes from the line of Lei Zhang from Bank of America Merrill Lynch. Lei, your line is now open.\nLei Zhang -- Bank of America Merrill Lynch -- Analyst\n[Foreign Speech] Thanks, management, and congrats on the strong results. My question is actually regarding your game business, which is quite solid in the second quarter. I wonder could you share more color on the performance of Princess Connect!. Specifically, what's your expectation on the longevity for this game?\nAnd secondly, can you give us some update on your game pipeline? Any game launch we can expect, specifically your expectation about the mobile version of Fall Guys? Thank you.\nRui Chen -- Chairman and Chief Executive Officer\n[Foreign Speech] Regarding Princess Connect! Re:Dive, it's like we expect this game will be having very long life cycle, and we expect this game to last quite -- to quite a long period. And for this game, our -- in many aspects, it has broke the historical record. In terms of pre-registered number, we have over 6.5 million people pre-registered, and the newly added user for this game also achieved a record high number. And the success of this game proves two one. One is that the ACG game has become the mainstream of young generation preferences over game genres. And second is, over the years, our ability to operate and sustain our ACG titles have improved significantly. And we're quite confident to continue the success.\n[Foreign Speech] And for games like Princess Connect!, with such large user base and within the four-month period of operating history, it has been very smooth in terms of operations and technical operations. So, this once again support our testimony that Bilibili is able to operate this genre's game quite well. As for the long life -- the life cycle of this game, we expect it could be something like FGO and to last couple of years.\n[Foreign Speech] As for our game -- overall game business, currently, we have over 30 games in our pipeline. And those games are not only ACG titles, we have been actively expanding our content offerings across different genres since last year, and we've made a quite good progress on some of the console games, indie games and have received good results.\n[Foreign Speech] The Fall Guys game that you mentioned is another example of our successful attempt in expanding into new genres. And looking ahead, we'll continue to explore the new genres that will fit to our user demographic.\n[Foreign Speech] In terms of revenue contribution, we believe ACG titles still have advantage in this area. And in our pipeline, we believe the Sword Art Online: Integral Factor will be a title that could make decent contribution in the revenue department.\nOperator\nOur next question comes from the line of Daniel Chen from J.P. Morgan. Daniel, please ask your question. Your line is now open.\nDaniel Chen -- J.P. Morgan -- Analyst\n[Foreign Speech] Thanks, management. I have a question on advertising. Our ad revenue growth actually accelerated on a year-over-year basis from -- in the second quarter. Should we expect the ad revenue to sustain such strong momentum in the second half? What are the key drivers behind? Is it brand advertising? Or is it because of performance advertising, including fees? So, what is our expectation for the new ad system we launched in the third quarter for the content providers? Thank you.\nCarly Lee -- Vice Chairwoman and Chief Operating Officer\n[Foreign Speech] Overall 2020 is still full of uncertainties and lots of vitality. However, under this challenging macro environment, we still delivered a pretty good advertising growth rate at 108% year-over-year.\n[Foreign Speech] So Bilibili has a video platform, we are one of the biggest beneficiary in the overall videolization industry trend. And we have observed that the advertisers' budget has shifted from the traditional portal to the video platforms.\n[Foreign Speech] As we mentioned earlier, we have invested significantly in expanding our brand awareness and raised our brand influence in the first half. And we have become the must go-to platform for advertisers, who wanted to reach the younger generation demographic, at the same time we also become the media center to create viral marketing event. And Bilibili's brand upgrade, brand awareness increases has direct relationship with advertisers' perception toward Bilibili's brand proposition.\n[Foreign Speech] So, as our user continue to grow and our PUGV ecosystem continue to thrive, we've seen that we've made decent progress in expanding advert content verticals, such as fashion, lifestyle, technology, fitness, as well as autos. So we are also hoping to reach, expand our advertisers' customers into those industry verticals.\n[Foreign Speech] So during the second quarter, we didn't make any singular marketing campaign toward certain verticals, but rather emphasizing our overall marketing solutions, as well as Bilibili's brand propositions and influence. And it's working well for us. And we aim to continue this strategy going forward.\n[Foreign Speech] The reason that the supporting system behind our Q2 strong growth is on our improvement in terms of our advertising products and our advertisers verticals, as well as our AI-powered algorithms to improve our ad efficiencies. And we're confident to carry on this good trajectory into the third quarter.\n[Foreign Speech] So looking ahead in Q3 and Q4, we are quite confident we can deliver a continued growth rate on our advertisement business and to develop a Bilibili specialty advertisement solution campaign.\n[Foreign Speech] So the area of focus could be on the e-commerce area. Bilibili's vibrant and engaged community has become many e-commerce platforms' ideal platform to promote shopping festivals and shopping events. So in the second half of this year, this could be a rising sector for us.\n[Foreign Speech] So as our content verticals expansion, we are quite confident to also expand our advertisers in those verticals.\n[Foreign Speech] The third point would be on the continuous improvement on our algorithm. We will continue to invest in improving our advertisement efficiency to increase our advertisers' ROI. And the fourth point is on the big events in the second half, there could be new variety shows, as well as new events and gala. And this type of Bilibili specialty event has become the advertisers' favorite advertising avenues to reach young audiences.\n[Foreign Speech] So the Sparkle [Phonetic] platform is a new platform we launched to help our content creators to connect with brand advertisers. And this platform provides our content creators, a pricing system, order management, as well as settlement services. We're hoping this platform will better serve our content creators to increase and expand their commercial potentials and increase their incomes.\n[Foreign Speech] Since its launch in July, we have over 8,000 content creator have already participated and signed up for this platform. For the GMV, we'll disclose when we reach a certain milestone.\n[Foreign Speech] And lastly, we'll continue to focus on ways of improving our data power to provide better decision making assistance, pre-sale or post-sale and to increase our content creators' earning power.\nOperator\nYour next question comes from the line of Alex Liu from China Renaissance. Alex, please ask your question. Your line is now open.\nAlex Liu -- China Renaissance Securities Limited -- Analyst\n[Foreign Speech] I'll translate myself very quickly. Just wondering what are the major difference in terms of operating know-how and the roadmap between live streaming business and all the core business. Should we consider live streaming as a business that requires some time of incubations and will reach an inflection point on user adoptions? If that's the case, how far are we standing from that inflection point? Thank you.\nRui Chen -- Chairman and Chief Executive Officer\n[Foreign Speech] Live broadcasting business is, as we mentioned earlier, has always been a part of our content ecosystem. This is not a singular commercialization avenue for us, but also an important part of our content. A live broadcasting also provides a very good avenue for our content creators to activate and retain their followers, as well as for them to increase their commercialization potential.\n[Foreign Speech] So, in the past few years, you may have noticed there's such heavy competition among other live broadcasting platform. However, Bilibili has remained within our own self-sustaining ecosystem that continuously helped talented content creators rising above, and they become our live broadcasting host and are providing very good content. This is quite different. Bilibili's business, live broadcasting business is quite different from other singular live broadcasting platform.\n[Foreign Speech] Our content offering on the live broadcasting business is actually mirroring what we have to offer on the video platform. For example, our popular game-related video would also be our popular live broadcasting content. And hence that, on Bilibili's live broadcasting verticals, games and talent shows and lifestyle-related content are the top verticals.\n[Foreign Speech] So you may have seen on our platform, a lot of the popular live broadcasting hosts are also our top popular top content creators. And there are two key factors among the live broadcasting industry. One is the good base of live broadcasting host, and second is a good base of users. And we believe we have these particular audiences for the two factors. We have both the highest quality content creator as, aka, our live broadcasting host, and we also have a very high-quality set of users who love to watch live broadcasting content.\n[Foreign Speech] So compared to other live broadcasting platforms, you're right about the revenue trajectory, we tend to have more stable growth instead of a sharply increased circle because their platform might pursuing [Phonetic] the signing top content host, which will drive the revenue in a short-term. But the merits of our business model is we tend to have a more stable and sustaining life cycle and our content creator, the live broadcasting hosts life cycle will also tend to be longer period.\n[Foreign Speech] We're quite confident to become the best platform for video content creators, given that the video equals live broadcasting content on our platform, we're also quite confident that will become one of the most popular live broadcasting platform in the future.\nOperator\nAnd that concludes the question-and-answer session. I would like to turn the conference back over to management for any additional or closing comments.\nJuliet Yang -- Senior Director of Investor Relations\nThank you once again for joining us today. If you have any further questions, please contact myself, Juliet Yang, Bilibili's Senior IR Director or TPG Investor Relations. Our contact information for IR in both China and the US can be found on today's press release. Have a great day.\nOperator\n[Operator Closing Remarks]\nDuration: 61 minutes\nCall participants:\nJuliet Yang -- Senior Director of Investor Relations\nXin Fan -- Chief Financial Officer\nRui Chen -- Chairman and Chief Executive Officer\nCarly Lee -- Vice Chairwoman and Chief Operating Officer\nAlex Poon -- Morgan Stanley -- Analyst\nLei Zhang -- Bank of America Merrill Lynch -- Analyst\nDaniel Chen -- J.P. Morgan -- Analyst\nAlex Liu -- China Renaissance Securities Limited -- Analyst\nMore BILI analysis\nAll earnings call transcripts\n\n\n\n\n"}
{"date":"Jul 30, 2020, 4:30 p.m. ET","exchange":"NYSE: GFF","q":"2020-Q3","ticker":"GFF","transcript":"Prepared Remarks:\nOperator\nThank you for standing by. This is the conference operator. Welcome to the Griffon Corporation's Third Quarter 2020 Earnings Conference Call. [Operator Instructions] I would now like to turn the conference over to Brian Harris, Chief Financial Officer. Please go ahead.\nBrian G. Harris -- Senior Vice President and Chief Financial Officer\nThank you. Good afternoon everyone. With me on the call is Ron Kramer, our Chairman and Chief Executive Officer. Our call is being recorded and will be available for playback, the details of which are in our press release issued earlier today.\nAs in the past, our comments will include forward-looking statements about the company's performance based on our views of Griffon's businesses and the environments in which they operate. Such statements are subject to inherent risks and uncertainties that can change as the world changes. Please see the cautionary statements in today's press release and in our various Securities and Exchange Commission filings.\nFinally, some of today's remarks will adjust for those items that affect comparability between periods. These items are explained in our non-GAAP reconciliations included in our press release. Now, I'll turn the call over to Ron.\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nThanks, and good afternoon everyone. I hope you and all your families are doing well in these turbulent times. Griffon entered the unprecedented COVID-19 pandemic from a position of strength, both operationally and competitively. Building on our already strong results in this fiscal year prior to March, our businesses have benefited from the stay-at-home nature of the pandemic. Both existing and new customers have been investing in home projects such as closet renovations, tending to their lawns and gardens and enhancing their enjoyment of the outdoors, upgrading the exterior of their homes, including their garage doors. We believe these trends will continue to grow in the years ahead.\nOur third quarter results were outstanding. Revenues increased 10%. Adjusted EBITDA increased 31% and adjusted earnings per share increased 90% compared to the prior year period. These results are a reflection of the strategic actions taken by Griffon starting with the September 2017 announcement regarding the disposition of our Plastics business and the purchase of ClosetMaid, further enhanced by the purchase of CornellCookson in June of 2018, coupled with the home improvement trends that I described. Our pivot out of the capital-intensive, commodity-driven Plastics business into branded domestically manufactured Consumer and Professional Product businesses positioned us for market share gains, as well as revenue, earnings, and cash flow growth.\nFurther underscoring this quarter's results, our 2020 nine-month free cash flow increased $34 million over the comparable 2019 nine-month period and builds on the prior year's full year free cash flow of $69 million. As a result of this performance, our net debt to EBITDA leverage has been reduced by one full turn from the prior year quarter to 4.4 times.\nEnsuring the health and safety of our employees and our customers continues to be our top priority. Since early March, we have proactively implemented health and safety measures across our global workforce as local and national authorities have circulated additional guidelines for employee health and safety. We've incorporated those as well. All of our facilities are operational and continue to maintain additional safety measures to protect our workers, while maintaining operations.\nIn Consumer and Professional Products and Home and Building Products, all of our U.S., Canadian, and Australian facilities were operational throughout the quarter. This includes all AMES, Closetmaid, Clopay and CornellCookson facilities. Each of these businesses provide critical products supporting national infrastructure. To the extent practical, we continue to permit our employees in these segments to work remotely and as I've mentioned before, all of our manufacturing and distribution facilities have implemented strict protocols to ensure employee health and safety, while at the workplace.\nIn late March, our AMES U.K. facilities were closed by government directive and our employees were directed to stay at home. By early June, we were able to reopen our facility there, which was ahead of our anticipated July resumption of operations. In Mexico, our ClosetMaid manufacturing facility that supports the U.S. and Canada sales closed for approximately 1.5 weeks in April, but has been operational since.\nTurning to our Defense Electronics business. Telephonics continues to operate at all of its sites as it provides critical manufacturing and services supporting the U.S. military and its operations are essential for maintaining our national security.\nLet's talk about the quarter and performance. In Consumer and Professional Products, we saw a strong third quarter demand for seasonal lawn and garden tools, storage and organizational solutions at major retailers and home centers across North America and in Australia. Upon reopening in June, there was strong U.K. demand for our product offerings as well. Our AMES strategic initiative remains on track and includes implementing an integrated business intelligence system, supporting all of our AMES operations, rationalizing our distribution and manufacturing facilities, and investing in automation and e-commerce capabilities.\nOur Home and Building Products segment revenue declined slightly compared to the prior year quarter. Strong residential sectional garage door sales, later in the quarter, almost completely offset the reduction in sales seen in the first part of the quarter. Sales in our commercial door business increased slightly in the quarter compared to the prior year.\nOperations at Telephonics have continued uninterrupted and Q3 revenue exceeded the prior year. The anticipated second tranche of bookings related to the Lockheed Martin MH60 Romeo foreign military sale program with India was funded and $49 million was booked to backlog in the quarter. Telephonics experienced some slowing from suppliers during Q3, which could slow certain customer deliveries and work performed in Q4.\nWe also are announcing today that we're evaluating strategic alternatives for the System Engineering Group, which we call SEG, which is a technical services subsidiary within our Defense Electronics segment, providing advanced simulation and analysis for the U.S. Navy and U.S. Missile Defense Agency. Telephonics' core business focus is on defense electronic systems, products, and systems. We believe that SEG would benefit from being part of a parent organization that is more focused on government technical services.\nAdditionally, we're cognizant of the government's Organizational Conflict of Interest called OCI standards, and believe that such a sale better aligns our businesses with those standards.\nSEG is well-run with a strong management team and annual revenues of approximately $30 million. The timing of this process is bolstered by SEG's recent $119 million award from the Naval Surface Warfare Center Dahlgren Division.\nThis is an opportunity for us to provide incremental value to Griffon shareholders, while also positioning SEG for enhanced growth with a suitable acquirer. We've already started the process to sell this business and we're working to get that done in the near future.\nLet's turn to our balance sheet. During the quarter, we continued to work on strengthening our balance sheet and positioning the company for future growth. In June, we issued an additional $150 million of senior notes as a tack-on to the 5.75% notes we issued in February 2020. We've now fully refinanced our $1 billion of 5.25% notes due in 2022 with 5.75% notes that have maturity in 2028. As a reminder, in January, we also extended the maturity of our revolving credit facility to 2025 and expanded its borrowing capacity by $50 million to $400 million with an additional $100 million of availability through an accordion feature.\nWe've established a solid foundation for growing the company and we have ample liquidity to weather any near-term effects of the pandemic and other market uncertainty, while continuing to invest in all of our businesses.\nFinally, earlier today, our Board authorized a $0.075 per share dividend payable on September 17, 2020 to shareholders of record on August 20, 2020. This marks the 36th consecutive quarterly dividend to shareholders, which has grown at an annualized compound rate of 17% since we initiated it in 2012.\nLet me turn it over to Brian for a little closer look at some of the numbers. Brian?\nBrian G. Harris -- Senior Vice President and Chief Financial Officer\nThank you, Ron. I'll start by highlighting our third quarter consolidated performance. Revenue increased 10% to $632 million and adjusted EBITDA increased 31% to $69 million, both in comparison to the prior year quarter. Normalized gross profit for the quarter was $165 million, increasing 6.8% over the prior-year quarter, while gross margin contracted 80 basis points to 26.1%.\nThird quarter selling, general and administrative expenses were $114 million including $1.6 million of charges related to the AMES strategic initiative. As a percentage of sale, SG&A, adjusted for the charges, decreased 280 basis points to 17.7%.\nThird quarter GAAP income from continuing operations was $22 million or $0.50 per share compared to the prior-year period of $14 million or $0.33 per share. Excluding items that affect comparability from both periods, current quarter adjusted net income was $26 million or $0.59 a share compared to the prior year of $13 million or $0.31 per share.\nThe effective tax rate, excluding items that affect comparability for the quarter, was 30.8% and year-to-date was 32.6%. Capital spending was $12 million in the third quarter, in line with prior year. Depreciation and amortization totaled $16 million for the third quarter.\nRegarding our segments, Consumer and Professional Products' third quarter revenue increased 20% to $329 million over the prior year quarter, driven by increased volume of 19%, propelled by customer demand for home improvement in North America and Australia, favorable price and mix of 1% and incremental revenue from the Apta acquisition was 2%, all partially offset by an unfavorable impact of foreign exchange of 2%. Organic growth was 18%.\nAdjusted EBITDA was $37 million, increasing 55% from the prior year quarter due to the increased revenue as mentioned a moment ago, partially offset by increased tariffs and COVID-19 related costs. Adjusted EBITDA margin was 11.3% compared to 8.8% in the prior year quarter. The AMES strategic initiative continues on plan and we expect to close our Belle Vernon, Pennsylvania and Falls City, Nebraska facilities by the end of the fiscal year.\nHome and Building Products' third quarter revenue decreased 1% to $219 million over the prior year quarter due primarily to decreased volume of residential sectional garage door orders in April, which were down 18%, but then had subsequent recovery in May and June. Adjusted EBITDA increased 16% to $39 million over the prior year quarter due to the benefits of general operating efficiency improvements, partially offset by the decrease in revenue and COVID-19 related inefficiencies and direct costs. Adjusted EBITDA margin was 17.9% in the quarter compared to 15.3% in the prior year quarter.\nDefense Electronics' third quarter revenue increased 5% to $84 million compared to the prior year period, primarily due to increased deliveries and volume of radar and communication systems. Adjusted EBITDA during the period was $4 million compared to the prior year quarter of $7 million impacted by mix and program inefficiencies on radar and communication systems, as well as increased bid and proposal costs. Year-to-date backlog as of June 30, 2020 was $350 million, a $19 million increase from Q2. And we expect to continue to build backlog in the fourth quarter. Corporate and unallocated expenses, excluding depreciation, were $11 million in the third quarter.\nRegarding our balance sheet, as of June 30, 2020, we had $72 million in cash and total debt outstanding of $1.13 billion resulting in a net debt position of $1.06 billion and debt-to-EBITDA leverage of 4.4 times as calculated based on our debt covenants. This reflects one full turn of deleveraging from the prior year period. Borrowing availability under the revolving credit facility was $274 million, subject to certain loan covenants.\nMoving to our fourth quarter and full-year outlook. Like many other companies, last quarter, we withdrew our guidance because of the uncertainties arising out of the COVID-19 pandemic. We now have a clear picture of the effects of the pandemic's impact for this year. As a result, we are reinstating guidance for fiscal 2020. We normally give guidance once a year and do not update that guidance during the year and we plan to return to that policy. However, given the continued uncertainty resulting resulting from COVID-19, we felt it was appropriate for us to provide an update as an exception in this instance.\nWe are now providing guidance for the full year 2020 of approximately $2.3 billion in revenue and $270 million plus of adjusted EBITDA before unallocated expenses. Note that our overall guidance, even with the conservative Q4 outlook, is higher than our original guidance for the year of $250 million plus of adjusted EBITDA before unallocated expenses that we provided back in November. Further, our full year fiscal 2020 guidance includes approximately $60 million for capital expenditures, $64 million for depreciation and amortization, $65 million for net interest expense and $45 million for unallocated expenses, with all of these remaining the same as originally communicated during our November 2019 earnings call.\nNow, I'll turn the call back over to Ron.\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nThanks, Brian. Griffon's year-to-date performance is something we are all collectively very proud of. Considering how much we've achieved in just a few short years since we began this portfolio repositioning, it's especially gratifying. At the time we announced it, we discussed the opportunities for top-line growth and margin expansion through the realization of efficiencies during the integration process of all of our acquired companies. Further, we expect it to become stronger competitively by providing increased value to our customers in terms of our broader product offering, improved service levels, and enhanced efficiency. We continue to believe the diversity of our businesses, our emphasis on domestic manufacturing, and our focus on the leading brands provides a strong foundation for future growth. This quarter in particular brings into focus what our repositioned portfolio can accomplish and the potential upside of following our strategy.\nGriffon's performance has been excellent and we believe there is still considerable opportunity for improving the performance of our businesses. In addition, we remain committed to finding strategic acquisitions that expand and strengthen our product portfolio within our home markets. We're getting closer to our objective of 3.5 times net debt to EBITDA leverage, our free cash flow has and will continue to improve and we expect to see our leverage to continue to decline further, as we execute our business plan.\nIn closing, I'd like to thank our workforce, which has shown exceptional dedication and perseverance throughout this challenging period. We appreciate the importance of their work in order to deliver these excellent results.\nOperator, we'll take any questions.\nQuestions and Answers:\nOperator\nCertainly. [Operator Instructions] Our first question comes from Bob Labick of CJS Securities. Please go ahead.\nBob Labick -- CJS Securities -- Analyst\nGood afternoon and congratulations on some terrific results.\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nThank you, Bob.\nBrian G. Harris -- Senior Vice President and Chief Financial Officer\nThanks, Bob.\nBob Labick -- CJS Securities -- Analyst\nYeah. So I wanted to start obviously particularly in CPP, just outstanding demand. How do you -- I guess, how long do you think this can last and how do you position your products and brands to get more attention and to become repeat purchases and replacement purchases and what do you need to do with this increased focus on your products to fulfill the demand that's out there?\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nWell, I'll start by reminding you that we were having a very good year going into COVID and the strength of our brands, the demand for our product was already ahead of expectations and certainly ahead of last year going into this pandemic. The structural changes that we clearly are seeing of how people are purchasing the types of products that we provide is -- had been moving to a way far more deliberate e-commerce-supported model, and that includes web searching as well as brick and mortar retail and online purchasing. And our strategy has been, for some time, that we're going to be the leading brands and the best products in every product that we sell. That was the story around AMES, that was the story around us buying ClosetMaid and then fitting it into AMES. So the strategy was clearly working. What happened with the stay-at-home is things are accelerating. And there is clearly an economy that's functioning quite well even during this incredibly difficult time.\nIt's not lost on us that we're at record unemployment, It's not lost on us that we're in a recession and yet our business trends are not only surviving, they're prospering. So that result of being at home we view as, it was working going into this, accelerating during it, and are -- the back-end of your question is what we've been doing in terms of investing in the business. The AMES strategic initiative that we had announced in November was about the future for the company about being able to expand our distribution capability, expand our product offerings. We are believers in brands, we're builders of brands, we've bought companies in every product category. We're at the early stages of what we view as the AMES growth initiative. And what you see in this quarter is clearly a very robust demand. At the same time, aside of operating efficiencies that were already in place, driving increased performance. So our plan going forward is to continue to do exactly what we have been doing in building the brands and supporting the best retailers, both brick and mortar and online for every product that we sell.\nBob Labick -- CJS Securities -- Analyst\nOkay, that's great, very helpful. And then, shifting over to Telephonics, the international is coming on and margins were a little late, I guess, in the quarter. How do you see -- is this year kind of the trough? Can we see some growth adjusting for the SEG, the potential strategic alternatives as you said? And so, how do you kind of look at the next 12 to 24 months on the Telephonics side?\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nYeah. We've talked about for some time that the Telephonics business was bottoming. We view that process as having played out as we expected. COVID clearly has had an impact on timing of orders, but the demand for the core surveillance and reconnaissance products, particularly radar systems, we continue to see the backlog improving. We expect that to showcase itself in the fourth quarter. The sale of SEG is the conclusion of what's been a very nice piece of Telephonics and the story behind it is we bought it in 2005, we've built it up, the sale of it is really about three things. One, it allows us to focus on the core of what Telephonics does. It should be a margin improvement story prospectively for us and it will be a small but meaningful additional part of our deleveraging story. So it's a gain. It's a business that we have built and the harvesting of it is part of our broader strategy of continuing to grow the core of Telephonics.\nBob Labick -- CJS Securities -- Analyst\nSuper. Congrats again on the quarter.\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nI appreciate it.\nOperator\nOur next question comes from Julio Romero of Sidoti & Company. Please go ahead.\nJulio Romero -- Sidoti & Company -- Analyst\nHey, good afternoon.\nBrian G. Harris -- Senior Vice President and Chief Financial Officer\nHi, Julio.\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nHi, Julio.\nJulio Romero -- Sidoti & Company -- Analyst\nSo on CPP, the strength you're seeing there, can you give us a little more granularity on what products are leading that growth? I know, you've got a very diverse portfolio and you called out outdoor lawn and garden, but you've also got some indoor lines like ClosetMaid, that I assume would have also done well, given everyone's kind of cooped up indoors. So I was hoping you could give us some specific examples of some product lines that are kind of leading that growth.\nBrian G. Harris -- Senior Vice President and Chief Financial Officer\nSure. So, you sort of hit it. We have seen growth in demand of -- in both lawn and garden and the home organization side. Home organization is a -- pretty much a do-it-yourself type item where people can buy the products either at a store or online and install it. Home and garden, of course, is something that's done mostly outside and we are seeing people using their time at home and the fact that they're not spending on other things such as travel or going to restaurants and investing in their homes. And generally speaking, our products are at price points that are affordable. They're not very large ticket items. And that's what's been driving some of that demand.\nJulio Romero -- Sidoti & Company -- Analyst\nGot it. And could you talk about maybe the sequential trend in CPP? Maybe how that business performed in May and June, and maybe give us a sense of how trends and fill rates are quarter-to-date?\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nWe continue to see...\nBrian G. Harris -- Senior Vice President and Chief Financial Officer\nSure.\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nWe continue to see trends improving. The stabilization had happened after the last time we spoke, which was late April, went into May, accelerated into the end of the quarter and continues into July. We expect this is going to continue: the market share gains of the products that we provide, the domestic manufacturingand distribution, and we've been talking for several years that this focus of ours on being able to support the biggest providers of all the products, it's clear that the supply chains are moving to domestically sourced product. We are the leading product, leading market share in every major product category that we sell and we're going to continue to invest in the brands to make sure that we get increased market share as we go forward.\nJulio Romero -- Sidoti & Company -- Analyst\nGot it. And you saw a really nice rebound on the residential garage door side. I remember last quarter you called out some customer hesitancy on the retail side, individuals kind of didn't want to stand in line at major home centers. Do you think there has been more of a change in customer behavior since April or was it more like the dealer side that drove that growth?\nBrian G. Harris -- Senior Vice President and Chief Financial Officer\nSo, yes, correct. We saw a decline in April. Our orders in April were down 18%, mostly being driven by home centers, retail type sales, with some decline in the dealers. As we progressed into May, sales started to normalize on all those channels and then come June and into July, sales accelerated quite well. And the commercial side saw good and normal volume and sales through the entire period.\nJulio Romero -- Sidoti & Company -- Analyst\nGot it. So across the board, kind of, dealer and retail did well in June.\nBrian G. Harris -- Senior Vice President and Chief Financial Officer\nYes, June and continued into July.\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nAnd we continue to see that trending up. The other point that I'll just make is the commercial side of the business is doing well. We bought CornellCookson, we had talked about the ability to provide the rolling steel doors as part of the warehouse business that was going to grow. Retail was going to continue to go through a transformation. The security part of our business, we're the leading manufacturer of a series of security doors, which is called the Defender Series, continues to show growth. The civil unrest that's going on around the country has actually spurred a level of demand in that business. The Clopay business was already the leading residential manufacturer. Owning CornellCookson gives us a leverage and we're at the early days of the integration of that business, obviously very gratifying to see the recovery from April residentially into May and it's, in our view, a reflection of the stay-at-home trends that are gone.\nJulio Romero -- Sidoti & Company -- Analyst\nGreat. Very nice job, everyone. I'll hop back in the queue.\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nWe appreciate it, thanks.\nBrian G. Harris -- Senior Vice President and Chief Financial Officer\nThanks, OK.\nOperator\n[Operator Instructions] Our next question comes from Tim Wojs of Baird. Please go ahead.\nTimothy Wojs -- Robert W. Baird -- Analyst\nHey, gentlemen, good afternoon. Nice job.\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nThanks, Tim.\nBrian G. Harris -- Senior Vice President and Chief Financial Officer\nThanks, Tim. How are you doing?\nTimothy Wojs -- Robert W. Baird -- Analyst\nGood, good, thanks. I guess my first question, just curious on channel inventory, particularly in CPP. How would you characterize that relative to normal? We're hearing some of the categories are pretty tight just in terms of the level of demand, kind of, in May and June and into July. So I'm just curious how you'd characterize some of your partners' channel inventories within your categories?\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nI think that...\nBrian G. Harris -- Senior Vice President and Chief Financial Officer\nSo we have actually -- I didn't mean to speak over you, so we have actually seen good demand for our products as we've already discussed. We have been able to service our customers very well. Our domestic manufacturing capability has really benefited us compared to others. So when major home centers need products, we are able to provide it to them or when any other home center or retail are needed. So we have adequate inventory and adequate manufacturing capability to continue to provide those products.\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nI think...\nTimothy Wojs -- Robert W. Baird -- Analyst\nOkay.\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nI think, in general, the inventory levels that we're seeing across -- and remember we service all of the major retailers from Home Depot to Loweâ\u0080\u0099s to Menards, the national hardware chains, the mass retailers. This is a trend that we continue to see that they're ordering more.\nTimothy Wojs -- Robert W. Baird -- Analyst\nOkay. Okay. And then as you think of the strategic initiatives, could you just talk about kind of where you're at on the process there and just has the pandemic, through the quarter, had any impact on the timing or are you guys ahead or kind of on track there?\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nI think we're...\nBrian G. Harris -- Senior Vice President and Chief Financial Officer\nWe continue to be on track. It's a three-year plan. Things are going on as planned, on budget, on time. Nothing has slowed down from the pandemic.\nTimothy Wojs -- Robert W. Baird -- Analyst\nOkay, great. And then the free cash flow performance in the quarter was really good. How should we think about free cash flow maybe in the fourth quarter? Should you also have a pretty good quarter, just given the demand strength you've seen?\nBrian G. Harris -- Senior Vice President and Chief Financial Officer\nYes. So, our second half of the year, that's our Q3 that we just ended, and our Q4 is our strongest cash flow months, cash generation quarters, I should say. And we continue to expect to increase cash flow into the fourth quarter.\nTimothy Wojs -- Robert W. Baird -- Analyst\nOkay. Great. Nice work on the quarter and good luck on the rest of the year, guys.\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nThanks, Tim.\nBrian G. Harris -- Senior Vice President and Chief Financial Officer\nThanks,Tim.\nOperator\nThis concludes the question-and-answer session. I would like to turn the conference back over to Ron Kramer for any closing remarks.\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nThank you all, stay safe, be well, bye-bye.\nOperator\n[Operator Closing Remarks]\nDuration: 32 minutes\nCall participants:\nBrian G. Harris -- Senior Vice President and Chief Financial Officer\nRonald J. Kramer -- Chairman of the Board and Chief Executive Officer\nBob Labick -- CJS Securities -- Analyst\nJulio Romero -- Sidoti & Company -- Analyst\nTimothy Wojs -- Robert W. Baird -- Analyst\nMore GFF analysis\nAll earnings call transcripts\n  "}
{"date":"Oct 23, 2019, 5:00 p.m. ET","exchange":"NASDAQ: LRCX","q":"2020-Q1","ticker":"LRCX","transcript":"Prepared Remarks:\nOperator\nGood day and welcome to the September 2019 Quarter Financial Call for Lam Research. At this time, I'd like to turn the conference over to Ms. Tina Correia, Corporate Vice President of Investor Relations. Please go ahead ma'am.\nTina Correia -- Vice President, Investor Relations & Corporate Communications\nThank you, operator. Thank you and good afternoon everyone, welcome to the Lam Research Quarterly Earnings Conference Call. With me today are: Tim Archer, President and Chief Executive Officer and Doug Bettinger, Executive Vice President and Chief Financial Officer.\nDuring today's call, we will share our overview on the business environment and review our financial results for the September 2019 quarter and our outlook for the December 2019 quarter. The press release detailing our financial results was distributed a little after 1 o'clock PM Pacific Time this afternoon. The release can also be found on the Investor Relations section of the Company's website along with the presentation slides that accompany today's call.\nToday;s presentation and Q&A includes forward-looking statements that are subject to risks and uncertainties reflected in the risk factors disclosures of our SEC public filings. Please see accompanying slides in the presentation for additional information. Today's discussion of our financial results will be presented on a non-GAAP financial basis unless otherwise specified. A detailed reconciliation between GAAP and non-GAAP results can be found in today's earnings press release. This call is scheduled to last until 3 o'clock PM Pacific Time. A replay of this call will be available later this afternoon on our website.\nWith that, let me hand the call over to Tim.\nTim Archer -- President and Chief Executive Officer\nThanks, Tina, and welcome everyone. In the September quarter Lam delivered solid results. Our continued execution to commitments combined with our guidance for the December quarter increases our conviction, that Lam is in a strong position to outperform as wafer fabrication equipment spending inflects higher. Doug will cover the financial results in more detail shortly, but I am especially pleased with the demonstrated earnings power of the company.\nAt the midpoint of our December guide calendar year 2019 diluted earnings per share will be the second highest in our history. Despite the current industry cycle. I would like to take this opportunity to thank our customers and partners for their continued support of Lam, and our employees throughout the world for their contributions to these results.\nFrom an industry perspective, we have revised upward our view on 2019 WFE to the mid-$40 billion range versus our prior estimate of down mid to high teens percentage year-on-year, which implied a low $40 billion level of spending. We are beginning to see improvement in the memory market, led first by NAND. NAND demand dynamics are improving and oversupply conditions should continue to abate as we move through the December quarter. We expect to exit 2019 with a bit supply growth rate for NAND of approximately 30%, which is well below our view on long-term demand. And as a result, NAND inventories are expected to decline to normalized levels in the first half of calendar 2020.\nWhile the timing of a memory equipment spending recovery is always hard to predict. We are encouraged that customers continue to manage supply growth even as we are starting to see favorable end market demand indicators. This is a sign of a healthy industry and a good set up for increased NAND spending in 2020.\nOn the DRAM front inventories have remained elevated and we do not expect them to reach normalized levels until the second half of 2020. However, we see positive demand catalysts ahead in both the server and smartphone markets. A server CPU upgrade cycle is expected to begin next year with increased adoption of new generation platforms from leading manufacturers. For smartphones major vendors are planning to launch additional 5G models, which is expected to drive content growth for the overall smartphone market in 2020.\nTurning to foundry and logic, spending in this segment has been strong throughout 2019 and based on recent customer commentary looks to remain so heading into next year. Diverse end market applications are driving higher levels of foundry and logic spending. Moreover challenges in scaling functional blocks such as; SRAM in logic devices are leading to increases in die sizes and these in turn are accelerating changes in device architectures and chip manufacturing technologies.\nLams growing position with key foundry and logic customers has positioned us to incrementally benefit from these secular trends. Competitively, we are executing at a high level. Based on the midpoint of our December guidance Lams 2019 foundry and logic revenues are set to significantly outgrow announced customer capex plans. The share gains we are now seeing in the foundry and logic segment are the result of close customer collaboration and strong product execution over many years and multiple technology transitions. They are evidence of the benefit of sustained investment in R&D throughout industry cycles.\nLooking at the market as a whole, including memory, foundry and logic, we are on track in 2019 to deliver our best ever penetration and defense performance, as measured by net forward-looking three-year revenue opportunity for application decisions made in this calendar year. A key contributor to our strong penetration and defense performance has been continued focus on technologies that enable 3D device architectures, which are becoming increasingly important to performance and cost scaling across all market segments. We invested early in 2D to 3D inflections and as these transitions are occurring we are seeing expansion in both our SAM and market share.\nEtch and deposition processes are critical enablers for 3D scaling, and we are investing aggressively to deliver the technology and productivity innovation required to satisfy customer roadmaps. As evidenced by our penetration and defense wins this year, we believe we are extending Lams leadership in this space.\nIn 3D NAND, we have successfully defended 100% of our memory whole dielectric etch positions and continue to be the supplier for this application at all 3D NAND manufacturers. We are also winning 3D NAND applications where productivity is the primary point of differentiation. Notably, Lam, has been the first to deliver production-proven edge yield solutions for etch. In this quarter, we used our Corvus tunable edge hardware on our flex dielectric etch system to improve profile tilt uniformity and win an important productivity sensitive slit etch application.\nOn the conductor etch front, we want to 3D NAND application for a new vertical architecture that reduces die size and is a technical solution for lowering bit cost. In deposition, we recorded an important 3D NAND win for the VECTOR DT, which deposits backside films to control stress as layer counts increase. Another significant deposition win was for our striker ALD tool used to deposit high quality liners and gap fill as aspect ratios get higher.\nWe also continued to extend our 3D expertise and position outside of the 3D NAND space, including in rapidly growing markets such as; advanced packaging and heterogeneous integration. Over the last three years, the installed base for our SABRE 3D electroplating system has grown by more than 70%, and we are the leading electroplating supplier for TSV for DRAM, CMOS image sensor and logic devices. Our SABRE 3D electroplating solutions embed best-in-class technology, backed by years of high-volume production experience.\nWith each successive win across our served markets, the installed base of Lam equipment continues to grow. Resulting in an expanding long-term revenue opportunity for our customer support business. To create value for customers over the entire life cycle of tool ownership, we are actively developing upgrades and advanced services, targeted extending technical capability and increasing productivity from existing installed base assets. These offerings help our customers reduce their total cost. And as a result, we continue to see growing demand.\nRevenues from our customer support business grew in the September quarter on a sequential basis and our Reliant business achieved record quarterly revenue for the third quarter in a row. We expect 2019 overall will be another growth year for our customer support business.\nLooking at our year-to-date performance. We have made tremendous progress against our objectives of expanding our SAM, increasing our market share and building our installed base business. Importantly 2019 has been a year where Lam has strengthened its position in the foundry and logic segment. Also with early indications of improving NAND demand and positive catalysts on the horizon for DRAM, we are increasingly optimistic that calendar year 2020 is setting up to be a year of outperformance for Lam, as spending mix boost back in our favor.\nThanks again for joining today and now here's Doug.\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nOkay, great. Thank you, Tim, and good afternoon everyone and thank you for joining us today. And what I know is a busy earnings season. We're pleased with Lam's performance in the September quarter. Our results once again exceeded the midpoint of guidance for all financial metrics. Operating income and diluted earnings per share came in at the high-end of our guidance range, as we remained prudent in managing our spending throughout the quarter.\nLet me begin as I always do by talking about our revenue segmentation in the September quarter. The combined memory segment was flat with the June quarter at 64% of total systems revenue. We had a decrease in the September quarter in the non-volatile memory segment moving from 46% to 38%, while DRAM increased to 26% from 18% of systems revenue. Spending in the NAND segment was focused on multiple nodes and we're beginning to see the first ramp of 128 layer structures.\nOn the DRAM side apart from the 1X and 1y nodes. We are seeing initial investments at 1z. As I noted in our last quarter earnings call, foundry and logic spending was strong and we expect strength from this segment to continue through the remainder of the calendar year. The foundry segment represented 25% of our systems revenue in the quarter. Strength in this segment is related to spending on the 7 and 5-nanometer nodes.\nWhile logic and other segment was down slightly from the prior quarter level coming in at 11% of system revenue. We've continued to demonstrate strong progress in the foundry and logic segments, enabling us to maintain solid profitability levels during a period of depressed memory spending. I believe foundry and logic spending will be even stronger in December.\nRevenues for the quarter came in at $2,166 million, which was again above the midpoint of guidance. While revenue had a slightly broader geographic mix in the September quarter, compared to the June quarter. Our top regions continue to be China, Korea and Taiwan. The China region quarter performance remains higher than our historic average concentration of revenue. And similar to what I talked about last quarter, the majority of this came from indigenous Chinese customers across multiple segments.\nGross margin came in at 45.4%, which was 40 basis points above the midpoint, mainly due to customer mix. And as we've stated in prior quarters, you should expect gross margins to be a function of several factors such as; business volumes, product mix and customer concentration and we expect to see variability quarter-to-quarter. We continue to manage our spending levels in the company, as operating expenses in the September quarter declined to $431 million, which was down from $450 million in the previous quarter. We remain laser focused on investing in research and development programs. As we saw the percentage of spending in R&D increased quarter-over-quarter to 67% of operating expenses.\nIn the December quarter, the guidance reflects total spending increasing back to the June level, primarily doing -- due to an increase in variable compensation expense. Our variable compensation fluctuates based on the level of quarterly profitability. But also remind you that as we look ahead to the 2020 calendar year, you will see the normal seasonal spending increases related to the March quarter, comes from things like payroll taxes. Operating income in the September quarter was $552 million and operating margin was 25.5% at the top of our guidance range.\nOur September quarter non-GAAP tax rate was approximately 11%, which was slightly lower than our long-term rate. There will be fluctuations in the rate from quarter-to-quarter, and we now expect our long-term rate to be in the low teens level.\nOther income and expense was a total of approximately $11 million in expense in the September quarter. The main components of other income and expense our interest income from the cash and investment balances we hold, offset by expense related to our outstanding debt. The total interest expense and all tranches of our debt is right now about $41 million per quarter. You should expect that other income and expense will fluctuate quarter-to-quarter, based on several market related items such as; our deferred compensation assets, venture capital investments and foreign exchange.\nWe continue to execute on our capital return program during the September quarter. We allocated $234 million to capital return in the quarter with $75 million related to open market share repurchases and $159 million in dividends. I would like to remind you that we continue to have an ongoing structured repurchase program that is expected to mature in the December quarter. This will continue to reduce our share count. We remain on track with our committed capital return. We currently have approximately $3 billion remaining in our Board authorized share repurchase program.\nDiluted earnings per share came in at $3.18, which was at the high end of the guidance range that we provided for September. We ended the September quarter with diluted shares for earnings per share at approximately 151 million shares, which is the seventh consecutive quarter where our diluted share count has declined. The share count includes a dilutive impact of approximately 5 million shares from the 2041 convertible notes. And I'll remind you the dilution schedules for the remaining 2041 convertible notes is available on our Investor Relations website for your reference.\nLet me now switch to the balance sheet. Our cash and short-term investments, including restricted cash, increased slightly in the September quarter to $5.8 billion from $5.7 billion in the June quarter. Cash flows from operations were $464 million, which was offset by share repurchase and dividends. Year-to-date in calendar year 2019, we have had strong cash from operations performance and we're on track to end this year with the second highest level of free cash flows in the company's history.\nDSO increased to 69 days versus 56 in the prior quarter. The DSO increase is related to the timing of customer payments occurring at the end of the September calendar month, which falls within our December fiscal quarter. Our inventory balance declined sequentially by $57 million, which is the fifth consecutive quarter where inventory balance decline. Inventory turns were 3.2 turns, which was just a little bit less than the 3.3 turns that we saw in the June quarter.\nNon-cash expenses included approximately $43 million for equity compensation, $49 million for depreciation and $16 million for amortization. September quarter capital expenditures came in at $39 million, which was a decrease from $66 million in the June quarter. Our September quarter-end headcount was flat with the prior quarter at approximately 10,700 regular full-time employees.\nSo now looking ahead I'd like to provide our non-GAAP guidance for the December 2019 quarter. We are expecting revenue of $2,500 million, plus or minus $150 million. Gross margin of 45% plus or minus 1 percentage point. Operating margins of 27% plus or minus 1 percentage point.\nAnd finally, earnings per share of $3.80 plus or minus $0.20 based on a share count of approximately 150 million shares. I'm pleased to share with you the results we've delivered throughout calendar year 2019 and what has been a challenging industry environment. As Tim noted the supply demand environment is improving for the memory segments and we've made good progress in our foundry and logic positioning. Our installed base business continues to be on track to deliver a growth year in 2019. We're well positioned heading into 2020 and are optimistic about our future performance going forward.\nFinally, I'd like to announce our plans to host an Investor Day on March 3rd, 2020 in New York City. Details on the venue and precise time will be forthcoming.\nOperator, that concludes my prepared remarks. Tim and I would now like to open up the call for questions.\nQuestions and Answers:\nOperator\nThank you. [Operator Instructions] And we'll take our first question from Atif Malik with Citi.\nAtif Malik -- Citi -- Analyst\nHi, thanks for taking my question and good job on the execution. Question on the WFE, Tim, you mentioned WFE going from low $40 billion to mid $40 billion. I want to spend, if the majority of the increase has come from the foundry\/logic segment in terms of the revised outlook?\nTim Archer -- President and Chief Executive Officer\nMaybe a few modifications, I mean, clearly, as we've said, we've continued to see strengthening in foundry and logic. So that is a portion of it. The -- some very early indications of NAND spending increase as we now guided for December quarter. And finally, continuing strengthening in the China WFE as we've, kind of, seen increased strength throughout the year. So combination of all those things lead to our upward revision in WFE.\nAtif Malik -- Citi -- Analyst\nOkay. And then just a follow-up in your prepared remarks, you mentioned foundry\/logic share gains above foundry\/logic capex this year. How should we think about the outperformance of your foundry\/logic business into next year and out given that some of the elements like reuse and growing EUV steps?\nTim Archer -- President and Chief Executive Officer\nWell, that's a great question, we basically -- as we have said on a number of occasions, the intensity of etch and deposition we see continuing increase at every technology node. Our SAM grows, whether it'd be 10 to seven to five to three on into the future. SAM increases even in the face of EUV increased usage. And there's a number of reasons for that; patterning complexity continues to increase regardless of the introduction of EUV, and so there are additional steps for deposition and etch.\nEUV itself introduces new requirements for hardmasks, which gives Lam opportunity to participate from a deposition perspective. And EUV also, we have talked about in the past introduces opportunities for new steps like end processes like atomic layer etching that can be used to help increase quality and productivity of the EUV pattern itself. So I think the way you should think about it is our SAM is expanding, competitively our -- we're gaining share at some of these new layers and we feel we're well set up in both the foundry and logic space going forward as technology transitions.\nAtif Malik -- Citi -- Analyst\nThanks.\nTim Archer -- President and Chief Executive Officer\nThanks, Atif.\nOperator\nThank you. We'll now take our next question from C.J. Muse with Evercore.\nC.J. Muse -- Evercore ISI -- Analyst\nYes. Good afternoon thank you for taking the question. I guess first question, if we look back to 2018, it looks like your share of wallet in -- for WFE with NAND it's roughly 30%. So curious as you think about moving to a rising layer count and your leadership in high aspect ratio etch and the just announced deposition wins on the call tonight. How should we think about your share of wallet as we go to 128 layer and above into 2020?\nTim Archer -- President and Chief Executive Officer\nOur SAM as a percentage of customer spend continues to increase with layer count and that's for two reasons; one, I mean obviously the simple fact of building and etching the higher stack, but also the fact that, as I mentioned there are new steps and new opportunities that created for dealing with issues such as; in the VECTOR DT case distress associated with those taller layer counts. So I think that our view is SAM grows as layer count increases.\nC.J. Muse -- Evercore ISI -- Analyst\nThanks, Tim. And I guess as a follow-up, Doug, I'm not sure if you spoke to the entirety of installed base revenues, but did they grow sequentially in September? And how should we think about the trend? Or what should we kind of model it to -- into 2020?\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nYes. C.J., I think, Tim, actually mentioned in his prepared remarks that they did grow sequentially and it was the third consecutive record quarter for the Reliant component of that business. I'm not going to quantify next year yet, a little bit too soon. But what we said in the past and I continue to be very comfortable saying today is, I have a hard time envisioning a year when the installed base business doesn't grow, it should grow every single year. Because chamber count grows every year, it's growing this year, even in a depressed memory spending environment and we continue to bring new advanced service offerings to market that we hope enable us to achieve more and more of the customer's opex spend. So that's how you should be thinking about that C.J.\nC.J. Muse -- Evercore ISI -- Analyst\nGreat. Thanks so much.\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nThanks, C.J.\nOperator\nThank you. We will now take our next question from Harlan Sur with JPMorgan.\nHarlan Sur -- JPMorgan -- Analyst\nGood afternoon, great job on the quarterly execution. This is second quarter in a row of the heavier China domestic mix. Do you guys anticipate this bias to continue into the December quarter and into next year and similar to my question last time? Is this in your view a focused effort by China to accelerate their semiconductor manufacturing capabilities, given the trade tensions with the US or more your China customers just having more confidence to move forward with their early memory and foundry programs?\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nYes, Harlan, what I tried to describe in fact, I'm trying to fore shadow with last quarter in earnings that this is above normal run rate of local Chinese customers spend. But Tim did point out in his remarks, that some of the strengthening in WFE came from local China probably now and nominally somewhat above $6 billion in WFE. And as we look into next year we absolutely think it will grow again next year, but it will ebb and flow, it will -- these big projects can be lumpy at times, and it will go up and it will go down depending on when equipment ships into any one fab projects. Tim, you want to add anything?\nTim Archer -- President and Chief Executive Officer\nYes, I think that -- as I commented, we've seen strengthening in domestic China spend through the year. Anticipate that continuing and maybe the most important part of that story for Lam is that clearly a big portion of the new incremental spending in China is targeted toward the memory market. And obviously our SAM, and our share in the memory space is quite good, so from that perspective we see China is area of strength for us.\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nYes, Harlan, I forgot the one part of your question you asked, do we think anything pulled in? Actually really don't, I don't think it would make sense that they would be pulling things in sooner and because if you're concerned about our inability to ship being the reason they pulled in, then they can get spares and service from us, they can't actually really utilize the tools very well. So I don't believe that there was pull-ons really do anything like that.\nHarlan Sur -- JPMorgan -- Analyst\nGreat, thank you. Thank you for the insights there. And the team continues its strong design win momentum on non-critical and\/or legacy technology node. As part of it, as you pointed out is the Reliant systems products continue to do well. We continue to hear from your customers that they're laser focused on productivity throughput, uptime, footprint all of the things that impact overall wafer costs. Are you guys now in a position to at least give us some sense on how fast the non-critical\/refurbished business systems -- business is growing? And roughly the size of this business relative to your total revenue base?\nTim Archer -- President and Chief Executive Officer\nMaybe you have to wait till Investor Day for that. No, we do plan -- we do -- we have promised for some time now to provide you more detail in those areas and we're just, we will do that. I think maybe a couple of points, your comment about customers being laser focused on productivity? I mean, it's one of the reasons why we have been talking about it, it takes some time for those products for our efforts to really start to show up in new wins, but you know we're starting to see in this area that Doug talked about in advanced services, where some of these intelligent database tools are really starting to help us reduce, for instance troubleshooting time on the systems, reduced unscheduled downs on the systems and those are things that the customers are pulling hard for because again it's productivity for tools that are already in place and relatively easy to implement. So we are prioritizing productivity, because it's in the best interest of the customer and the industry as a whole.\nHarlan Sur -- JPMorgan -- Analyst\nYes, thank you.\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nThanks, Harlan.\nOperator\nThank you. We'll hear now from John Pitzer with Credit Suisse.\nJohn Pitzer -- Credit Suisse -- Analyst\nYeah, good afternoon guys. Thanks, let me ask the question. Congratulations on the strong results. Tim, I just want to go back to the market opportunity in logic\/foundry for you. If you kind of look at calendar year-to-date that business combined for you was up somewhere between 30% to 40% year-over-year? I guess, I'm just trying to get a sense of how we think about your market position, maybe in North America as we see 14 go to 10 go to seven and maybe in Taiwan as we see seven go to five go to three, can you talk a little bit about how much visibility you have on product tool of record on some of these critical etch and deposition steps? And how we might think about your share opportunity as we migrate down these nodes?\nTim Archer -- President and Chief Executive Officer\nSure, I can do that without quite getting as specific as North America, Taiwan on those notes. So maybe I'll point you just a couple of comments, I made in [Indecipherable] there was a little bit, you know, as I said it within the logic and foundry space, it takes many years to establish yourself as the first -- the development tool of record. And then ultimately see that rollout into volume buys is the production tool of record. And so when we talk about I gave -- we gave a little bit of a new look into this penetration and defense. Forward-looking three-year revenue opportunity statement, that is designed to give some indication as to how long it takes from the time we win one of those selection decisions and you'll see that revenue opportunity will take place over those following three years, that's definitely true in the foundry and logic space.\nAnd so I think that when we talk about improving opportunity at 10 and then seven and then five, you know, you can kind of look out and say, if you're like a 5-nanometer decision is revenue opportunities that now we're roll in over the course of the next several years. So that may not be quite the level of specificity you wanted, but it basically says things that we are winning now will actually be our revenue for the next three years plus in that space.\nJohn Pitzer -- Credit Suisse -- Analyst\nThat's helpful. And then, Doug, you mentioned in your prepared comments, you still have about $3 billion left on the buyback, and I apologize in capital allocation call, but this most recent quarter, the buybacks dipped down a little bit, which I guess is understandable, just given the level of uncertainty. Any color you can give us around the pace at which you might want to try to execute buybacks going forward? And how we should think about, kind of, just remind us again the cash return policy you're trying to hit?\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nYes, John, I mean, one thing I would point out to you and if you look over the last two years, you will have seen several quarters where the cash we actually deployed moved down somewhat. That was because in the quarter before that we put one of these accelerated share repurchase programs in place. You have the same phenomenon going on this quarter. So even though the cash that we deployed in terms of open market repurchases wasn't all that significant this quarter, that ASR was still executing buying stock back, and that ASR that's currently out there will complete in the December quarter. So we'll be thinking about what we're going to do incrementally as we go forward.\nSo far, just remind you what we talked about and it's been a while now the last Analyst Day that we're committed to at least 50% of free cash flow returned to shareholders, and obviously if you look at our history, over the last five, six years, we've done a whole lot more than that. And I had went on the timing to complete the current authorization and I'm going to kind of remain that way. I've said in the past, we'll be opportunistic and that's as much as I have quite right now.\nJohn Pitzer -- Credit Suisse -- Analyst\nPerfect. Thanks, guys, congratulations.\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nThank you, John.\nOperator\nThank you, we'll take our next question from Timothy Arcuri with UBS.\nTimothy Arcuri -- UBS -- Analyst\nThanks a lot. I guess my first question, Doug is can you help us a little bit with the mix in December. I'm curious, if the uptick in revenue is going to be more on the NAND side and more on the foundry side? Thanks.\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nYes, what I said, Tim in my remarks, was I expect December will continue to be pretty strong with foundry and logic quarter. So that's a key piece of what's going on.\nTimothy Arcuri -- UBS -- Analyst\nOkay, awesome. And then I just wanted to -- I just wanted to drill down a little bit into the China piece. So China is about 25% of your revenues now on the trailing 12-month basis. So I guess, I'm curious how much of this is going into indigenous projects versus the multinationals. Because I thought you said China was about $5 billion of 2018 WFE, and I think at that time, you were talking about $3 billion of that $5 billion being domestic China. And I think you just said that China is going to be over $6 this year. So can you sort of like level set us on how much of that $6 this year will be multi-versus domestic and maybe how much domestic can even grow next year? Thanks.\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nYes, let me walk it back for you a little, Tim, because some things have moved around a little bit. When I look at what happened last year, local China ended up being I don't know $4.5 billion of WFE roughly. So it ended up being maybe a little bit more than that for that we have been talking about and the way we see it today, it's above $6, it's somewhat above $6. I don't know for sure what next year is going to look like. But as we look at our analytics in the fab projects that are coming in and whatnot. I do see pretty strongly believe it will grow next year. I'm not ready to tell you how much yet. We'll give you more clarity on our WFE view for next year on the next earnings call. But I think local China will continue to grow next year.\nTimothy Arcuri -- UBS -- Analyst\nAnd, Doug just to clarify those numbers are local China numbers right?\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nThat's right, Tim. Yes.\nTimothy Arcuri -- UBS -- Analyst\nOkay. Awesome, thanks so much.\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nYes. You're welcome.\nOperator\nThank you. We'll take the next question from Toshiya Hari with Goldman Sachs.\nToshiya Hari -- Goldman Sachs -- Analyst\nYes. Thanks for taking the question and congrats on the strong results. Tim, you talked about early signs of a recovery in NAND in your prepared remarks. And Doug, you just mentioned that most of the growth or at least implicitly, I think you commented that most of the growth in December quarter should be coming from foundry and logic? So should we expect some of the NAND projects that we're all collectively hearing about should hit the March quarter from a rev rec perspective?\nTim Archer -- President and Chief Executive Officer\nYes, it's maybe there is not such a big change here from what we've said. We -- you know, ever since beginning of the year, we said that memory spending would likely remain relatively weak throughout the year. And when I talked about early signs, it is the -- it's very early is in there, we're now starting to see some of those projects transpire as you just talked about, meaning a little bit of ordering occurring in the December quarter, but we still maintain our view that we exit the year with this 30% bit supply growth rate and that customers are prudently managing the supply growth, but I do think those projects, you know, it's kind of that early signs, it's a healthy industry and we're going to see growth in 2020. So exact timing, we really don't want to give you that right now, but it's -- it looks to be coming.\nToshiya Hari -- Goldman Sachs -- Analyst\nGot it. And then as a follow-up, I just wanted to hit the logic and foundry opportunity dynamic into 2020. Obviously, you guys have done a great job over the past couple of years and gaining share in both buckets. If we assume that spending in logic and foundry is largely flat in 2020, and if you assume EUV adoption continues to grow. Based on what you guys know from a design win or application win perspective, can you still grow logic and foundry revenues in that sort of environment backdrop? Thanks.\nTim Archer -- President and Chief Executive Officer\nYes, it's a great question and the answer is yes, we would expect to grow in that scenario, based on a couple of things; one, as you move forward, even on the same WFE, our SAM as a percent of that WFE should increase as transition still continued to occur to more advanced nodes. Etch and deposition opportunity increases at each successive technology node, even in the face of EUV. So I think in the scenario described, we would expect to have a larger opportunity and we do believe that we're winning share as well and therefore we would grow.\nToshiya Hari -- Goldman Sachs -- Analyst\nGreat. Thanks so much.\nTim Archer -- President and Chief Executive Officer\nThanks, Toshiya.\nOperator\nThank you. We'll hear now from Krish Sankar with Cowen and Company.\nKrish Sankar -- Cowen and Company -- Analyst\nYes. Hi, thanks for taking my question. I had two of them; first one for either Tim or Doug. More a industry focused question you spoke about how NAND bit growth exiting this year is going to be 30%, kind of, curious like ask your customers start ramping 128 layer NAND, if next year demand bit growth is below 30%. Do you still expect the 120 layers spending to go through next year, because it's more strategic, low cost in nature? Or do you think it might get throttle back if demand bit growth is slower?\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nMaybe I'll take and then Tim you can add-on. I mean, Krish what -- one I don't think that's what's going to happen. But we're that to be what happened, I think you would see a year that looked something like this year in that most of the industry spending was allocated to node conversions as opposed to new capacity adds, because that lowers cost per bit, the economics are better and all of that.\nThe other thing I would say, and then I'll let Tim add-on. When we look into early next year, I believe supply growth rate will continue to decline based on the investment set have occurred this year, right? Because they have reduced this year and so you're moving into a declining rate of growth, as we look into the first half of next year. Tim, anything you want to add?\nTim Archer -- President and Chief Executive Officer\nYes, I think just to reiterate Doug's point, I mean, technology transitions we think occur every year, simply because of the benefit to bit cost. And so, I guess, I would say that in any year, which is not our view of declining supply growth we would still see the majority of the spend in technology transitions. And I guess there is one other key point to think about, we've mentioned this a few times in a technology transition from say 96 layers to 128 layers, the majority of that spend is for etch and deposition. So there's definitely an outperformance statement there, if spend continues to be based just on technology transitions.\nKrish Sankar -- Cowen and Company -- Analyst\nGot it, got it. That's very helpful. And then as a follow-up, I think, Tim in your prepared comments you spoke about how you guys are successfully defended 100% dielectric etch market share. I'm kind of curious on the NAND side, is that a fair enough statement, if you look past 128 layer higher than 128 layer DTOR tools or is it more up to 128 layers?\nTim Archer -- President and Chief Executive Officer\nWell, in our statement is always as those decisions are made. So we always speak about accomplishing made. So I don't know if any decisions have been made well beyond the 128 layer node. So we -- it's obviously something that we compete for it every node. But, I guess what I'd point out is there is a very important piece of learning that has come from us running now millions of wafers through our dielectric etch tools. And there was a question earlier about, productivity, reliability, stability, defect performance. Those are all things that again we have millions and millions of wafers of experience. And so kind of come in with an edge every node that you have to compete for as the incumbent. So that -- but specifically, I think, you could bucket most of those in that 128 nanometer and below node since their decisions already made.\nKrish Sankar -- Cowen and Company -- Analyst\nGot it. Thanks, Tim. Thanks, Doug.\nTim Archer -- President and Chief Executive Officer\nThanks, Krish.\nOperator\nThank you. We'll hear from Patrick Ho with Stifel.\nPatrick Ho -- Stifel -- Analyst\nThank you very much. And also congrats on a really nice quarter. Maybe, Tim, first, a lot of the market questions have been answered on my end. But as you look at next generation memory technologies like MRAM, ReRAM. Can you just give a -- maybe a qualitative view of how Lam is positioning itself to capitalize on those next generation opportunities?\nTim Archer -- President and Chief Executive Officer\nYes, I guess maybe the simpler statement that I make inside the company is we're not running from our leadership position in memory, and that includes in these new emerging memory markets. And so we're actively looking to develop new applications, new tools that meet the needs of those devices. We've spoken about, one of them in particular so far this year, which is the ion beam edge tool, that's used for MRAM and we have established a very strong position for that particular application, phase-change memory ReRAM, there are other devices we are actively engaged in development with the leading companies. So it is a target market for us, in fact, one might argue that we feel we, sort of, we already sort of own that memory space and I think it's our focus.\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nIt's Dough [Phonetic] just to add-on, if you really want more detail you can go look at the transcript of the Flash Memory Summit, where Tim and Rick Gottscho spent lots of time talking about how we view these emerging memory architectures.\nPatrick Ho -- Stifel -- Analyst\nGreat. Thanks, Doug. And maybe as my follow-up question, you talked a little bit about your atomic layer deposition opportunity. I guess from a big picture perspective, how do you see the total available market for you in that? And do you see it expanding from where -- it looks like you have a strong position on the memory side of thing. Can this also expand onto the foundry\/logic side of things?\nTim Archer -- President and Chief Executive Officer\nSo we'd already has expanded, I mean, ALD is not memory specific. So we use these films also on the logic and foundry side. ALD atomic layer etching and atomic layer deposition and atomic layer etching, these are technologies that will continue to be increasingly used as devices become smaller and smaller and structures become more complex. So I think it's an expanding market opportunity, and in fact I think in coming years, you'll start to see inflections for instance from batch processing tools to single wafer ALD just again for the type of wafer uniformity and requirements of those processes going forward. So it's an area where we're growing and we feel confident about our development activities in the tools themselves.\nPatrick Ho -- Stifel -- Analyst\nGreat. Thank you.\nTim Archer -- President and Chief Executive Officer\nThanks, Patrick.\nOperator\nThank you. We'll hear now from Craig Ellis with B. Riley FBR.\nCraig Ellis -- B. Riley FBR -- Analyst\nYes. Thanks for taking the question. Tim, I wanted to follow-up on the comments that you made that calendar '20 to be a year of outperformance for Lam. Can you just help us understand how much of that comes from moving deeper into the sweet spot of the foundry\/logic share gain that you've been talking about versus help that you would get from what appears to be a nice and very encouraging upturn that's starting to occur in NAND or maybe something else like SAM expansion?\nTim Archer -- President and Chief Executive Officer\nYes, I think for us to give you more detail on the break out on that you'll have to wait until we actually speak to our 2020 WFE outlook next quarter. But you kind of hit it, I mean, we -- the way I think about outperformance in 2020, it's just what you said. First and foremost you -- everyone knows that we are highly leveraged to the memory market, and we do believe that spending mix moves back in our favor next year. And even in the face of stronger and continuing strength in logic and foundry memory will improve to some extent. We've strengthened our logic and foundry SAM opportunity, as well as share position and so that's a continued benefit as logic and foundry remain strong. And also as Doug mentioned CSBG continues to grow as we expand our portfolio of advanced services in that space. And so can break it out for you, how much each of those contributes, but each of them is important part of the story in 2020.\nCraig Ellis -- B. Riley FBR -- Analyst\nThanks, Tim. And then I'll do the follow-up to Doug. Doug impressive trough-to-trough operating margin improvement of about 300 basis points. And within that there is dramatic improvement with operating expense as a percentage of sales. And as you noted, there's been significant mix shift R&D. The question is how much further benefit is there in the model for increased operating leverage? And how much room do you have to further drive expense toward R&D from SG&A?\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nIt's something we've been working on for years, I mean, Tim was driving those on years ago, honestly in rest of companies rally behind it. We're going to keep squeeze in efficiency out every SG&A dollar we spend. We want to be totally rigorous about that. So that we can allocate more of those dollars to R&D, I think that 60%, 70% last quarter might be an all-time high for the company. I haven't gone all the way back, but in my recent memory that was an all-time high. We're going to keep at that, we're going to continue to try to get better, we do this every words part of the culture of the company to be focused on continuous improvement. I don't know how we can get it obviously, but we're going to keep working on it.\nCraig Ellis -- B. Riley FBR -- Analyst\nThanks guys.\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nThanks, Craig.\nOperator\nThank you. We'll hear now from Vivek Arya with Bank of America.\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\nThanks for taking my question. And I joined a little late, so I apologize if this was asked. But DRAM was quite strong in the quarter. And I'm wondering what caused that and how sustainable is that trend?\nTim Archer -- President and Chief Executive Officer\nWhen I look at it, it's primarily conversion spending. That's really what we've seen for the entire year is focused on node conversions, it will ebb and flow. The important thing when you think about DRAM is to understand when we look at similar to what we were describing NAND exiting the year below where we believe demand growth to be, you got a similar story in DRAM. As we look at the investments that are occurring in DRAM this year exiting the year supply growth is probably in the low teens. And we believe long-term demand growth is in high teens maybe approaching 20%. There is a ways to go, Vivek to continue to burn inventory out of the channel. I think that's going to take a little bit longer. But what I do know is at some point the inventory will be burned off and spending will grow more significantly. In quarter-by-quarter, it's just going to be dependent on what projects are under way at what customers.\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\nGot it. Very helpful. And then as a follow-up, kind of, looking at your cash flow generation. So fiscal '19 from what I noticed there was a lot of cash inflow from working capital that I'm looking at the model right. How should we think about the plus and minus from working capital this year? Thank you.\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nIf you look at the first half of this year, Vivek -- calendar year again. I never really think too much in terms of fiscal calendar year. I mean we're -- cash was just super strong, I think we had two consecutive quarters around $900 million in operational cash flow and you're right. A lot of that came from working capital. Now what you normally see with the business when it's growing, it will consume working capital, meaning it will take cash to build inventory and receivables and so forth. When it levels off or contracts, it will generate cash and that's really what went on in the first half of the year. I mean, we managed cash quite proactively, but the practical reality of business ebb and flow was that's what happens. The right way to think about the free cash flow of the business is it's a couple of points below where operational cash flow should be on a sustainable basis. But it will ebb and flow around wherever read in the business cycle.\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\nThank you.\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nYes. You're welcome. Thanks for the question.\nOperator\nThank you. We'll take our next question from Joe Lachky with Wells Fargo.\nJoe Lachky -- Wells Fargo -- Analyst\nYes, thanks for taking the question. You talked about improvements and inventory that you've seen across the NAND flash. I was wondering, if you could talk about 2018 [Phonetic] factory utilization rates and your installed base?\nTim Archer -- President and Chief Executive Officer\nIt's hard for us actually to put our finger on exactly what utilizations are. I mean we saw it pulled back a little bit in both NAND and DRAM this year. And I think that was pretty well-telegraphed from our customers. But better -- it's a better question to put to them, we don't always know exactly what their utilizations are running at.\nJoe Lachky -- Wells Fargo -- Analyst\nOkay, fair enough. And then maybe a follow-up to that. You talked about exiting this year at 30% supply growth, I mean, for NAND and maybe and potentially going lower than that next year on the first part of the year. I guess, the question is how do we think about the level of capacity expansion needed to hit kind of the -- I guess, expected demand growth for 2020?\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nTough question to answer Joe, to be honest. What's occurred this year and NAND largely has been conversions, maybe with a couple exceptions. But if you look at NAND, WFE through the year -- this year, but that's what was going on. And you saw declining rate of supply growth such that as we exit the year obviously, we said 30% and I think long-term NAND growth is in the high '30s, maybe 40%. To have 40% supply growth, we need to be adding a few wafers every single year, and so it didn't happen quite so much this year and you've seen supply growth decline. I don't know if that helps you, but that's how I think about it.\nJoe Lachky -- Wells Fargo -- Analyst\nOkay, thanks.\nOperator\nThank you. We'll take our next question from Mitch Steves with RBC Capital Markets.\nMitch Steves -- RBC Capital Markets -- Analyst\nHey guys, thanks for taking my question. I really had two and most of them have been answered. But from a high level, I mean, do you guys talking about kind of a better market for memory in 2020. So when do you think we'll see capacity upgrades or is this all going to be technology upgrades?\nAnd then secondly, you guys gave a lot of color on NAND, but not so much in DRAM. So based on the commentary about server demand and kind of an increase in Q1. Does that mean you guys think that -- that's going to be kind of the bottom or do you think that exiting the year, we're going to start to see supply demand balance for DRAM?\nTim Archer -- President and Chief Executive Officer\nWell, I think that what we've said about DRAM maybe just was that we think through the first half of next year. Inventory remains elevated and so it's really not, I guess our view at this point is DRAM maybe more of a second half story for next year. Obviously we'll give far more color as we develop our full 2020 outlook. It's just that NAND is much more upon us right now. Simply because the issues are being worked through more quickly as a result of the supply constraints that have been in place this year. And maybe also the demand catalysts for NAND that are occurring right now.\nMitch Steves -- RBC Capital Markets -- Analyst\nGot it. And is a capacity upgrades at what time in 2020 is that like back half or do you think capacity upgrades will begin earlier than that?\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nMitch too soon for us to talk in any detail about 2020, hold off for one quarter we'll give you a little better visibility on it. It's still a little bit too far away for us to get into detail.\nMitch Steves -- RBC Capital Markets -- Analyst\nOkay, got it. Thank you.\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nThanks, Mitch.\nOperator\nThank you. And that does conclude today's question-and-answer session. I'd like to turn the conference back over to Ms. Correia for any additional or closing remarks.\nTina Correia -- Vice President, Investor Relations & Corporate Communications\nJust wanted to thank you everyone for joining us today. Appreciate it.\nOperator\n[Operator Closing Remarks]\nDuration: 55 minutes\nCall participants:\nTina Correia -- Vice President, Investor Relations & Corporate Communications\nTim Archer -- President and Chief Executive Officer\nDoug Bettinger -- Executive Vice President and Chief Financial Officer\nAtif Malik -- Citi -- Analyst\nC.J. Muse -- Evercore ISI -- Analyst\nHarlan Sur -- JPMorgan -- Analyst\nJohn Pitzer -- Credit Suisse -- Analyst\nTimothy Arcuri -- UBS -- Analyst\nToshiya Hari -- Goldman Sachs -- Analyst\nKrish Sankar -- Cowen and Company -- Analyst\nPatrick Ho -- Stifel -- Analyst\nCraig Ellis -- B. Riley FBR -- Analyst\nVivek Arya -- Bank of America Merrill Lynch -- Analyst\nJoe Lachky -- Wells Fargo -- Analyst\nMitch Steves -- RBC Capital Markets -- Analyst\nMore LRCX analysis\nAll earnings call transcripts\n\n\n\n\n"}
{"date":"Nov 6, 2019, 12:00 p.m. ET","exchange":"NASDAQ: BBSI","q":"2019-Q3","ticker":"BBSI","transcript":"Prepared Remarks:\nOperator\nGood day, everyone and thank you for participating in today's conference call to discuss BBSI's Financial Results for the Third Quarter Ended September 30, 2019.\nJoining us today are BBSIs President and CEO, Mr. Michael Elich and the Company's CFO, Mr. Gary Kramer. Following their remarks, we'll open the call up for questions.\nBefore we go further, please take note of the Company's safe harbor statement within the meaning of the Private Securities Litigation Reform Act of 1995. The Company provides important cautions regarding forward looking statements. The Company's remarks during today's conference call will include forward-looking statements. These statements, along with other information presented that does not reflect historical fact are subject to matter of risks and uncertainties.\nActual results may differ materially from those implied by those forward-looking statements. Please refer to the Company's recent earnings release and to the Company's quarterly and annual reports filed with the Securities and Exchange Commission for more information about the risks and uncertainties that could cause results, excuse me, that could cause actual results to differ.\nI'd like to remind everyone that this call will be available for replay through December 6, 2019 starting at 3:00 PM Eastern Time this afternoon. A webcast replay will also be available via the link provided in today's press release as well as available on the company's website at www.mybbsi.com.\nNow I'd like to turn the call over to the Chief Financial Officer of BBSI, Mr. Gary Kramer. Sir, please go ahead.\nGary Kramer -- Chief Financial Officer\nThank you, Michelle. Depending upon where you're dialing in from, good morning or good afternoon, everyone. We had a very strong quarter that resulted in record earnings. Diluted income per share for the quarter increased 30% to $3.24 compared to $2.50 in Q3 of '18.\nGross billings of $1.55 billion grew 7% over the same period. PEO gross billings increased 8% to $1.52 billion compared to the third quarter last year. The third quarter of 2019 had one more work day when compared to the third quarter of 2018. When adjusting for the one-day difference, our gross billings increased approximately 6% over the prior year period.\nGross billings grew by 5% in California, versus 15% in all other combined geographies. Same customer sales were 5.7% compared to 4.7% in Q3 of '18. However, adjusting for the one-day difference, same customer sales would have been approximately 4.3% which was lower than Q3 of '18 and lower than our internal plan.\nWe continue to increase our client base with the gross addition of 386 clients or 217 net of runoff in the quarter. The 386 gross additions are a record number in any third quarter in our history.\nNet revenue of $248 million reflects a slight increase compared to $247.3 million in Q3 of '18 and reflected weaker staffing revenue, which decreased 17% to $33.8 million compared to Q3 of '18.\nThe decrease in staffing revenue is a direct result of the continued tight labor market, and we anticipate that staffing will remain a slight headwind to near-term revenue growth. Gross profit outpaced gross billings growth and increased 19% to $70.8 million compared to $59.7 million at Q3 of '18.\nGross payroll taxes and benefits as a percentage of payroll was 6.8% in Q3 of '19 versus 6.9% in Q3 of '18. Workers' compensation expense as a percentage of gross billings was 3.6% this quarter, which is below our expected range of 4.4% to 4.6%. This compares to 4.5% of gross billings in the third quarter of 2018.\nThe third quarter is when we reset our triangles and bring in another year of experience. The independent actuarial valuation resulted in a reduction of prior year estimated liability of $5.6 million. Also as previously discussed, we restructured our arrangement with Chubb to reduce frictional costs and this is the first pure quarter where all policies are effective on the more efficient structure.\nOur workers' compensation claims frequency continues to trend favorably. In the quarter, we saw trailing 12 month relative frequency of claims as a percentage of payroll decrease 12.9% compared to the third quarter of 2018. All in, we are very pleased with the way our workers' compensation portfolio is performing. We have taken many steps and actions which are yielding positive results. We are conservative and deliberate and this strict focus and attention has resulted in a redundancy in the portfolio, seven quarters in a row and why our expense continues to come in lower than our range.\nPayroll as a percentage of gross billings is increasing as other components of gross margin decrease. This is related to an increase in PEO business mix and continued expansion outside of California where many states have lower payroll tax and workers' compensation ratios.\nSG&A in the third quarter was $41.4 million which is 13% higher than the prior year quarter. This increase includes a timing portion for the extra business day plus a slight increase in profit sharing. We continue to be mindful and diligent about balancing spend against growth while investing in the business for the future.\nFor the full year of 2019, our SG&A is expected to be on plan.\nThe provision for income taxes in the third quarter was $6 million. As mentioned last quarter, we increased our annual effective tax rate estimate from 18% to 22%.\nMoving to the balance sheet. We mentioned last quarter that we successfully renewed our 7\/01\/19 insurance program with Chubb. This was a significant renewal, because we have moved closer together with our collective view of the actuarial loss rates. This was a tipping point for the balance sheet and results in accelerated growth of our unrestricted cash balance and our free cash flow.\nAccordingly, our unrestricted cash and investments were $137 million at 9\/30\/19 which is $36 million greater than 6\/30\/19 and a $100 million greater than 12\/31\/18. The restricted cash and investments, which are primarily comprised of the Chubb trust was $420 million at 9\/30\/19. The $557 million combined unrestricted and restricted cash and investments will continue to be invested in a manner consistent with our previous disclosures.\nWe continue to stay conservatively invested in shorter duration securities in the near term, we will [Phonetic] flattening yield curve. At 9\/30\/19, we had $173 million in cash that returned an annual crediting rate of 220 basis points. At September 30, the book yield for the invested portfolios was 238 basis points with a duration of 1.71 years. At 09\/30\/19, the average quality of the invested portfolios was AA and no investment was greater than 4% of the portfolio.\nIn the quarter, we earned $3.7 million of investment income. On the liability side of the balance sheet, we have no material updates. We had no borrowings on our credit line as of 9\/30\/19 and we continue to be debt free except for the $4 million mortgage on our corporate headquarters in Vancouver Washington.\nTurning to capital allocation. We have built a financial note around the Company and we will continue to be diligent and mindful regarding balancing investment in the Company while returning capital to shareholders. We have an authorized stock-repurchase plan, which is another tool to drive shareholder value but we did not buy back any stock in the quarter. We increased the dividend last quarter by 20% and have returned $6 million to shareholders so far this year.\nIn summary for the quarter, our branches are continuing to meet or exceed expectations regarding the control [Indecipherable] for gross and net client adds. We continue to experience margin expansion through product relevance while reducing costs in our model. Our gross billings continue to increase even with the softness of uncontrollable same customer sales. We continue to invest in the business and future growth and mindful of expenses and looking for savings and efficiencies in everything we do. Our pipeline remains strong and we continue to build our base of net new clients. Our referral relationships and distribution channels continue to widen. Our balance sheet has made the turn and we've built a financial note to support the Company but more importantly, our core earnings are strong and predictable.\nRegarding our outlook for the remainder of the year, we continue to expect gross billings growth for the next rolling 12-month period to be approximately 8%. This contemplates continuing deceleration in staffing revenue and same customer sales growth for PEO to be similar to what we have experienced thus far in 2019.\nFor the full year 2019, we are raising our estimate for diluted earnings per share by $0.65 to approximately $6.05. This increase reflects our core operating results, performing as planned, plus our workers' compensation portfolio performing better than expected, which is partially offset by an increase in our effective tax rate to 23% from 18%.\nFor the fourth quarter of 2019, we expect the range for workers' compensation expense as a percentage of gross billings to be 4.3% to 4.5%. This range can also be applied as an approximation when looking forward to 2020.\nNow I'd like to turn the call over to the President and CEO of BBSI, Mike Ellich, who will comment further on the recently completed third quarter as well as our operational outlook for 2019. Mike?\nMichael L. Elich -- President, Chief Executive Officer\nHello and thank you for taking time to be on the call. As we do each year, we spent much of September in the field reviewing progress of 2019 and looking forward to 2020. From my view of the business, the organization looks strong and we continue to execute to our plan and support of our fundamentals.\nAdditionally, in September we introduced a new website and a new URL mybbsi.com. This is the first step moving forward, that will make us, excuse me, this is the first move in several we will make in the coming months to more accurately represent our value proposition to the market.\nAlso, we continue to spend time in the field with referral partners and business owners working to understand what they may be seeing in the market. These efforts and our visibility to the business continue to support confidence in our value proposition we -- as we look at the market.\nLooking forward in the quarter, we added 386 new PEO clients. We experienced attrition of 169 clients, 15 due to accounts receivable, 13 for a lack of tier progression, three due to risk profile, 20 businesses sold, 45 businesses closed and 73 left due to pricing competition and companies that have moved away from the outsource model. This represents an approximate build in the quarter of 217 net new client.\nAlso in the quarter, we took time to pull 10% of our existing clients to better understand what they may be seeing and speaking with these clients a majority are profitable and continue to see relevance in their offering, despite runway and opportunity, lack of skilled labor continues to be the limitation to growth and there continues to be some uncertainty related to a variety of macro issues. In general, the business owners we spoke to expressed optimism, but are not able to find the talent they need to grow, which is why we believe we are seeing softness in same customer sales.\nRelated to pipeline, we continue to see strong client adds in the quarter and we believe this is a result of our referral partners understanding and recommending BBSI. We continue to evolve our ability to scale from a model based on individual market contributors to a systemic approach for developing referral channels on a national basis. Today, we are seeing development of new referral channels in all markets which support strong pipeline growth as evidenced by continued new client adds.\nRelated to organizational structure, we continue to build the field organization to support future growth, scale into new markets and invest in support of our product offering. In the quarter, we added one business team bringing us to 114 business teams across 63 branch locations. We continue to build organizational structure at all levels, to that end, in October, we announced the addition of Diane Dewbrey to our Board of Directors, bringing our total count to eight members.\nRelated to branch stratification, we have 18 mature branches with run rates in excess of $100 million. This is a measure we use to indicate branches ability to increase leverage. We have 20 emerging branches running between $30 million and $100 million. We regularly reinvest back into these teams to support capacity as they grow.\nFinally, we have 25 branches we consider developing with run rates of up to $30 million. In these branches, we invest to support consistency of pipeline while maintaining integrity of product as they scale. As we add infrastructure to support capacity as dictated by our pipelines, we pay particular attention to our ability to add business teams in support of our growth. Looking forward, the fundamentals of the business are strong. We remain focused on bringing predictability and value to the business over the long run. Feedback I have received from our clients and referral partners supports relevance of our product as we look at the next five years.\nHaving spent a great deal of time in the field this year, my confidence in our ability to execute comes from the strength of our teams and the structure that allows us to stay nimble. We continue to invest in infrastructure that supports both product evolution and our ability to scale into new markets with predictable outcomes. Today, we have a foundation that is strong, we know where we need to focus our energy and we are executing to our plan.\nWith that, I'll turn it over for questions.\nQuestions and Answers:\nOperator\nThank you, sir. [Operator Instructions]. Our first question comes from the line of Chris Moore with CJS Securities. Please proceed with your question.\nChris Moore -- CJS Securities -- Analyst\nHey, good morning to you guys.\nMichael L. Elich -- President, Chief Executive Officer\nHey, Chris.\nChris Moore -- CJS Securities -- Analyst\nYeah, good morning. Maybe just focus a little bit on growth specifically outside California and kind of the impact that, that has kind of near and mid-term. Just start with maybe on the referral channels, so the referral channels that you have in California are well established. Can you talk a little bit about kind of how they look outside of California?\nGary Kramer -- Chief Financial Officer\nHey Chris, it's Kramer. So that's a good question and what we've really focused on is consistency in our product and consistency in how we deliver the product and how we go to market. So if you think about how we try to forge these relationships on a national basis, we've got a strategy for how we work with our referral partners in every state.\nSo if you're referral partner in Utah, you get treated to the same sort of service and platform as California. So it's going to vary by market, some of our markets that are more mature, like in the Mountain States versus, say, our East Coast branches that are opening up, that are going to take a little time to get those channels developed but the basic idea is, if you go in any BBSI store front, it looks the same, no matter what state you're in, and that referral partner gets treated with the same respect and service everywhere.\nMichael L. Elich -- President, Chief Executive Officer\nYeah, Chris, I might add to that, one of the things that I saw probably in the reviews that we did in the third quarter, just being out in the field was, one, our bench of leadership in all markets is very consistent. And you really don't see very much a difference between, call it, California and the Mountain States of the East Coast. The other thing I would say is that as we may have had -- if we grew up on the West Coast and California with more of an insurance offering in the past, as we've evolved that brand and have shifted it, that's taken more effort and we've had to reeducate and retool a lot of our referral partners in California. As we look at other states where we probably came at, a lot of our growth through a different value proposition, we're seeing an adoption of our current value proposition in those markets and probably an acceleration through our existing pipelines in those markets where we actually see a higher effective yield coming out of the referral channels that we get in markets outside of California.\nChris Moore -- CJS Securities -- Analyst\nIt's interesting, I mean from a kind of customer or client size, It's -- the clients are smaller that you're -- on average that you're signing outside of California. You had kind of historically talked about a five-year timeframe for a successful branch to reach that $100 million level. Does the, kind of, starting on the smaller side, does that impact much that -- that potential progression that you see?\nMichael L. Elich -- President, Chief Executive Officer\nYeah, there is a little bit more of a headwind. And what you -- there is two sides to the smaller customer. The smaller customer is a lot of times when you see a new branch coming online, there is maybe a tendency to be more comfortable adding the smaller company and as you get more traction, you'll see that average client employee size increase in all markets.\nSo that's kind of the standard, but then you have to take into consideration that if you look at companies in Southern California versus companies in Utah or Boise, Idaho, there tends to be just by nature of population size and market demographics, they just tend to be smaller.\nSo it will take a little bit longer for us to get there, but one of the things I would say to is, today in our overall model, we get there faster today because I think we're more efficient in how we're adding and building pipeline and how we're adding business, than we maybe have been go -- if you went back 10 years ago.\nChris Moore -- CJS Securities -- Analyst\nGot it. That's helpful. I appreciate it. I'll jump back in line. Thanks guys.\nOperator\nThank you. Our next question comes from the line of Jeff Martin with Roth Capital Partners. Please proceed with your question.\nJeff Martin -- Roth Capital Partners -- Analyst\nThanks, good morning, Mike and Kramer. How are you?\nMichael L. Elich -- President, Chief Executive Officer\nGood morning, Jeff.\nJeff Martin -- Roth Capital Partners -- Analyst\nI was wondering if you could comment on the implied Q4 guide relative to your updated guidance of $6.05 for the year. What implied down year-over-year, I know there are some things going on with payroll taxes, but I think it'd be helpful to kind of get some insight from you in an open format here on that.\nGary Kramer -- Chief Financial Officer\nYeah. So if you think back for Q4 of '18, we have, call it, two non-recurring, so we had a change in estimate for workers' comp which was like $2.3 million. So when we're giving any forecast for the forward look, we don't forecast for any change in estimate. So that's one of the puts and then the other one was in Q4 of '18, we were estimating that we were going to have a payroll tax that was going to be due that ended up not being due. So, we took down that accrual in Q4 of '18.\nSo you've got, call it, two credits from '18 that don't repeat in '19. So if you normalize for those, we still are getting to earnings growth for Q4 of '19.\nJeff Martin -- Roth Capital Partners -- Analyst\nOkay. And then I was wondering if you could give us an update on the progress on some of the new branches and new business units that have opened up this year.\nMichael L. Elich -- President, Chief Executive Officer\nSo as we've added new branches in new markets, we're finding that there is two style of branches. We'll say that if we add a branch in a market adjacency, we'll call that a tuck-in, typically those branches are started with talent that's already been working in a branch, be it a current business partner that may be moves to a new branch and opens that, for example, with that you're taking experience in 10 year and you're combining that with a book of business that gets started, that might be peeled off from local branches that it makes more sense for those customers to be in the new branches.\nWhen that happens, that branch one gets off the ground faster because of the talent, but also the momentum that's already there with the existing client and typically there is already a somewhat of a pull where you've got existing referral channels already built around that market.\nSo in those branches, we will find that they move pretty fast through that $20 million to $30 million to $50 million. They all have to go through a retool and a rebuild right around $60 million and we tend to get there more proactively today than we ever used to. But when I look at new branches that have ramped in the last couple of years, they're all doing very well, we don't have any branches that are stuck or needing to be retooled at this point relative to anything that's new. When we look at markets that we enter as a greenfield, we tend to take a little bit more time on the front end by having either that new manager or whoever is going to be running it sit in the wings for up to six months and really learn the business before they go out and enter those markets.\nWhat's helping us a lot also is that our referral channels are broader and once we go into a greenfield market, we find that we're able to create pipeline a lot quicker, so the pace of a greenfield might be a little bit slower than the tuck-in, but we're also seeing where those branches are ramping faster than historically.\nGary Kramer -- Chief Financial Officer\nAnd I would just throw some numbers on it. When we set out our plan for the beginning of the year, we had, call it, four to five new branches. So far this year we've opened three branches, two in California and one in Colorado and we're in the process of signing the lease to open a location for another one in the Allentown area.\nSo we're, call it, hitting our number for the branches, and then when we think about the business units, business units were a little behind for our plan for where we thought we'd be. I think for the year, we're going to be slightly below it, and that's really just a function of timing more than anything else, more than change of strategy, it's just the timing on when you have to find the people, get them in and get them operationalized.\nMichael L. Elich -- President, Chief Executive Officer\nYeah. We're looking at where we optimize the efficiency of capacity utilization against where we need to be to make sure we don't stall pipeline or anything. And our cap view has come up. If it was running closer to 58%, 59%, call it, at the beginning of the year, today, we're clustered about 64%, but we feel like we still have good runway to build capacity as necessary to business units, but we are kind of seeing where we are gaining more efficiencies through our teams and we're getting more done as well, so.\nJeff Martin -- Roth Capital Partners -- Analyst\nOkay. And then with the additional build on the balance sheet in terms of unrestricted cash. How are you looking at investments for growth versus share repurchases at this point?\nGary Kramer -- Chief Financial Officer\nYeah, I mean first and foremost, when we think about having excess capital, right. The first thing we're going to do is we're going to invest in our businesses and invest in our branches in our business units. And then we're going to look and we're going to invest in things that make the Company either revenue synergies or expense synergies, ie, IT, information technology. And then you know, we're not a very acquisitive company, when you think of our value prop. People are our product then why buy it when you can grow it. So then we get down to the next tranche which is raising the dividend, which we've done and then stock purchase -- stock repurchase, which the Board authorized last quarter for $50 million over three years. That's a tool that we will utilize if we see any kind of dislocation in the market to be a backstop for when we think the stock is undervalued and I can just say that we don't have an itchy trigger finger and we're going to be smart and methodical with how we spend our shareholders dollars.\nMichael L. Elich -- President, Chief Executive Officer\nYeah, I would say too and to complement that, Jeff, that when we look at investments that we've made, typically when we add a branch, it's not capitalized. So it just comes up through our own earnings stream and it becomes the headwinds to earnings. One of the areas that we have been putting a lot of energy back into is just bringing a new look and maturity level to our overall IT platform and once we get into 2020 and beyond, we'll be rolling that but with probably a broader strategy today than we've had in the past, relative to how we're building technology and where we're going with that as a complement to our existing infrastructure and model, so.\nJeff Martin -- Roth Capital Partners -- Analyst\nRight. All right. Okay, last question. Some of your peers have had issues with underwriting healthcare insurance. Just want to clarify that you have no exposure to underwriting healthcare and some of the similar issues that others are having.\nGary Kramer -- Chief Financial Officer\nYeah. So we do not offer healthcare to our clients, as you're seeing with some of our peers that they can be difficult risk to underwrite and we don't really feel the need for it in our value prop. When we think about the risk we do take, call that, workers' comp and for that risk, we have a very methodical process for how we bring clients on, for how we work with the clients to align better for how we can work with them to mitigate risk and we feel like, really we can make that a better underwriting decision as opposed to the healthcare side, which is more of a challenging risk that it's more difficult to mitigate.\nMichael L. Elich -- President, Chief Executive Officer\nYeah. I would also say that, Jeff, as we've grown and matured our model over time, that the healthcare side is although an opportunity, I think it always has been a little bit of conflict with what we're really trying to get done with our business owners and we're running our high-touch model, I would rather be non-captive to health benefits and have professionals that can come in and really support our clients for where they're living rather than have one stop fits all and -- and as we have stayed outside of that and stayed risk-neutral on the healthcare level, we still have mechanisms, where we can help our clients find the best resources, but we do that as a service rather than taking underwriting risk.\nJeff Martin -- Roth Capital Partners -- Analyst\nGreat, thank you guys.\nOperator\nThank you. Our next question comes from the line of Josh Vogel with Sidoti & Company. Please proceed with your question.\nJosh Vogel -- Sidoti & Company -- Analyst\nThank you. Hi, Mike and Kramer.\nMichael L. Elich -- President, Chief Executive Officer\nGood morning, Josh.\nJosh Vogel -- Sidoti & Company -- Analyst\nMike, you usually give us some commentary around the average pay and over time trends across your client base. I was wondering if you could share that with us.\nMichael L. Elich -- President, Chief Executive Officer\nSo, in the quarter, I'll probably defer to the absolutes with Kramer. One of the things that we have seen probably is it relates to growth in same customer sales are still probably coming from wage inflation and, but I'll let Kramer talk to this more of the detail with that.\nGary Kramer -- Chief Financial Officer\nYeah. Hey, Josh, it's more of the same trends that we talked about last quarter. So when I give you numbers here, I'm going to adjust it for the one extra day. So we're still seeing, of our 4.3% increase in same customer sales, the lion's share of that is wage inflation, which is going to be in the mid-to-high 2's. And then after wage inflation, you get a little bit of a bump up in headcount adds. And then you get after that, you get a little bit of a bump up in hours worked so when we're looking at how this -- how our same customer sales is performing, it's probably going to be in this -- over this next cycle, I'll say, next 18 months, it's going to primarily come from the wage inflation. I don't -- with unemployment at a sub-35, I just don't see how we're going to get the uptick in WSCs.\nMichael L. Elich -- President, Chief Executive Officer\nYeah. And I would say, Josh and meeting and spending time with our clients, they are -- a lot of them just turned a good spot. They're doing well. They're profitable, they're making money and what we did notice probably over the last couple of quarters is that wage or hours worked did somewhat normalize were to me that's where business owners aren't finding that they have to stress their organization to capture market opportunity, but more have modulated themselves to make sure that their capacity is aligned with the opportunity and not to push it to have a lot of over time, and in doing so, I think, are running more profitable businesses.\nThe one flip, and this is maybe off this mark a little bit that we noticed in the conversation that we we're having a couple of weeks with a group of owners, is that you're seeing a little bit of a transition where you have an old guard and a young guard. The older guard is the group that is on the businesses for a long time lived through '08, '09, '10 and as they look at their business, they can think about growth, they can think about where they're going. But they are not going to break it to take unnecessary risks.\nThe interesting part is the younger guard is coming in where you've got maybe a mid-30's group that seems to almost be a split now in the room where they're actually buying companies, they're doing acquisitions, they're more aggressive and they are building for their future. And so there is a little bit of a shift going on there, it's more anecdotal at this point, but I think that there is a little bit of that going on as well.\nJosh Vogel -- Sidoti & Company -- Analyst\nThat's helpful. Thank you. And I don't want to get too into the weeds here, but you did mention that 45 businesses closed in your attrition number for PEO clients and I was just curious, is that mostly being seen in California or elsewhere and then I can't find it in my notes, but i'm just, it seems a little high. I was wondering how that stat has trended this year and how often you evaluate your client base and given how immersed you are in their business as a partner, do you typically see the writing on the wall before they do?\nMichael L. Elich -- President, Chief Executive Officer\nSo, we've got very good visibility as we work with that client. The idea of closing versus selling is probably a closing could mean that they changed in FDIA[Phonetic] number and move to different ownership structure and we probably wouldn't be able to see or dissect that as much as we recognize that the business was there and then it wasn't there,\nThe businesses that sold, we recognize that they moved -- they shifted ownership structure there and typically we might capture that same business on the other side, but the trend has upticked in the last couple of quarters between businesses sold and businesses closed. But one thing I'd kind of look at that a little bit too, though, is this, on a relative basis if you said I have 65 clients in the quarter that either closed or sold, it's less than 1% of our total base of business. So as our overall base grows, those numbers may get skewed a little bit when you look at them, just on a -- from a real standpoint.\nGary Kramer -- Chief Financial Officer\nYeah. And I would say, Josh, we pay attention to companies that have the potential to go dark from a credit perspective and we've got a push, we push $6 billion through the pipe. And if you look at our allowance and our expense for companies that go dark, it's not even a rounding issue because we got pretty, pretty tight on how we do that side of it. So we're usually ahead of it than behind it if they are going dark.\nJosh Vogel -- Sidoti & Company -- Analyst\nGreat, thanks for the thoughts around that. And just around that, let's say, you rolled out, I was curious how that's being received across the client base. And can you discuss some of the other efforts that are planned for rollout and if this involves any notable investment or outlays on your end?\nGary Kramer -- Chief Financial Officer\nSo,\nMichael L. Elich -- President, Chief Executive Officer\nI'm reluctant to call it anything related to a rebrand and that when you start to shop different in the market, that's how it can be perceived. What I would say is that as we discussed internally, we started to really rebuild and restructure and realign who we are from the inside out before we ever decide we could look different from the outside looking in.\nAnd so when we pull the organization as a whole and we ask them when do they really think that we started to rebound or retool ourselves, people will point back to 2011, 2012. We finally have reached a place where all the pieces that we've been pulling together for the last many, many years have reached a place where we can actually tell a different story.\nAnd that story has been well received. I think that if you go out to the new website, It's under mybbsi.com, you'll see maybe a story that represents a lot of what we've been talking about the last couple of years, but it aligns us with what we really believe were brand to market and as business owners and different people see it they -- with the one comment that I've had back for me is that it finally talks about what we really do. And that's where we're excited about that.\nAs we look forward, I think that as we look at what's possible from here, we've got a very strong core business. I think we've got good core discipline around how we interface with our clients through our blueprinting, through how we basically manage and manage the full client life cycle through our framework process that we have and then ultimately how we tie that out with the talent that we have in front of clients every day, and then how we support that with technology.\nSo those are all things that will continue to enhance as it relates to different places that you might see us show up. It will be -- you might find us in different venues, showing up in our -- in different ways. But I think the real emphasis toward where the direction we're going is, when you think about mybbsi versus BBSI, it implies community and when we look at business owners that we pulled together, we are building communities both locally and super regionally around an idea that they don't have to be alone and that they actually have a place to go and a partner that they can be there with to help them increase their own probability for success.\nSo that's the direction we're going with it and but through these communities that we're building, and we've been, -- we've been working on this for about three years now, when we bring a group of business owners and we start to get them to talk to each other, it's game changing. And as we get better in the field working with our clients, it's actually accelerating. So I'm excited about all those things and we'll keep you posted as there is more to look at.\nJosh Vogel -- Sidoti & Company -- Analyst\nSounds good. Thanks for taking my questions guys.\nOperator\n[Operator Instructions]. Our next question comes from the line of Bill Dezellem with Tieton Capital Management. Please proceed with your question.\nBill Dezellem -- Tieton Capital Management -- Analyst\nThank you. I have a group of questions. And I'd like to start just picking up on where you left off. Early in the opening remarks, you said that mybbsi was just a first of many steps that you will be making to highlight your value proposition. Would you please kind of open the shades on the window and give us a look into what you're going to be doing from this point forward to highlight that value proposition?\nMichael L. Elich -- President, Chief Executive Officer\nWell, I'm going to make them blind and as we kind of turn the little thing in the blinds up a little bit, let a little bit of sunlight in, I'll give you that much. How about that?\nBill Dezellem -- Tieton Capital Management -- Analyst\nThat's great.\nMichael L. Elich -- President, Chief Executive Officer\nAs we look at -- again, if there is a theme about what we've been building over many years, it's been about creating a client interface where our clients see us as a true partner, and through the interface that we have with them over a long period of time, they see us as their true advocates.\nAs we look also to our referral channels and we educate and help them understand the value they can bring to their clients by introducing us into the DNA of their client base, that begins to support it. So if you look at the theme around mybbsi being a community, there are a lot of things we can do there related to our access point where we can bring them in, and give them exclusive access to the collective of business owners that we work with.\nSo I think that when we look at technology aligned with that, that becomes one way that we are broadening that network and access to information that's proprietary to us. When I look at just where we start to show up outside of what we do already, we do a lot of our, I'll call it, referral channel developing through a networking strategy and through a channel strategy and we build it through an event strategy and as we have events where we bring a lot of our referral partners in to really understand and have an experience with BBSI as well as our channel partners that we work with that support us as well as we bring customers in that becomes a little bit of an incubator to learn a little bit more.\nWe have today three LPGA events that we use where we'll bring and do create environments that literally it's -- there is barrier to entry. They can't get into those but over periods of times, we've brought groups through and we've got very, very firm relationships over time. With that we've looked at the idea of front running new markets that we might be getting too and creating a way -- efficient way and cost effective way to being able to start building a -- building visibility in the market to a broader footprint over time and using the LPGA a little bit, but we've actually, this last year we're on three or two new golf bags that are on tour year round out on the LPGA.\nWhat we recognize there is 77% of those individuals that participate in a Pro-Am and participate as business owners in Pro-Ams are CEOs or business owners. So we're tapping a market that allows us to, one, create an experience, we're also getting our brand out in front of us without being -- go on TV and media wise. But we're creating environments to build relationships with our referral channels and then ultimately to begin to expand and create avenues where the brand of BBSI and mybbsi are being seen by those people that might be our audience either today or in the future and creating more of a curiosity approach.\nBill Dezellem -- Tieton Capital Management -- Analyst\nThank you. And you had also mentioned that your referral relationships were widening. Would you talk about that and really what you mean when you state that?\nMichael L. Elich -- President, Chief Executive Officer\nWhen I look at somebody that is a potentially a person that's aligned and a trusted advisor to a business owner, when we first meet them, we would probably tier them as a Tier 1 referral partner and that individual probably can kind of get who we are, they see us as may be an opportunity for them to create business for themselves, but it tends to be a little more transactional. So as we recognize the work we have to do through education and through helping them see maybe the opportunity through a different lens, we spend a lot of time working with that -- those individuals both in local markets in micro regions throughout our network of branches and then on a more global basis as we get to a point where we're doing business and they're starting to get to understand our value proposition, we'll bring them into environments to help them see their -- see the product through the eyes of their own business, if that makes sense.\nSo if you think of somebody that might own a -- an accounting firm or a law firm or an insurance agency, they're running a business and rather than help them see the product is that might be explained will bring them into a similar environment that we bring our business owners into and when we do that, they actually start to see the product from the inside out and start to really understand the nature of what we're trying to do.\nFrom there, we double back and we'll tend to work with their internal organization to help mature and help them understand it. That might lead us to a Tier -- a Level 2 or Tier 2 referral partner that at that time now all the sudden becomes one of those areas where we've got a still handhold a little bit, but they're catching on and they're getting there.\nIf we can now evolve that relationship from Tier 2 to Tier 3, you get the Tier 3 referral partner that probably understands they can articulate our value proposition, as well as we can. Now they're really doing work for us in the market.\nBill Dezellem -- Tieton Capital Management -- Analyst\nThat's helpful. And as you so presumably have been, you are seeing an increasing number of the partners you would consider Tier 3 and hence the widening of the relationships.\nMichael L. Elich -- President, Chief Executive Officer\nYeah. And so one of the areas, the one of the ways we look at that is through yield, and as we look at opportunities that we have presented to us versus the number of conversions or the yield on the original opportunities, that's a little bit of where we then start to stratify where is that business coming from, from who and then what's our effective yield with different audiences.\nThe one thing that we have also seen in this last quarter and probably a couple of quarters is a significant uptick in referrals from existing clients.\nBill Dezellem -- Tieton Capital Management -- Analyst\nMike, I think you mentioned in your opening remarks or somewhere in this call that the California yield was less than referral channel yield was less than outside of California. So congrats on having more referrals from existing customers. But what can or needs to be done to improve that referral channel yield in California?\nMichael L. Elich -- President, Chief Executive Officer\nAnd I would probably -- what I meant was the way the channel works is if you look at first meeting to second meeting to third meeting to fourth meeting, there's -- the fall off happens differently. When we finally get to the ultimate yield of the ultimate --- of the first pipeline that we see to the end, it's pretty much in line with what we see and in California as well and it's pretty consistent across all states, but how it happens is different.\nSo I thank you for bringing that up so I can clarify that. The other part, though, that I would say is that, as we have seen the uptick of even with client referral, it's the more we execute and the more clarity we bring to the market as to what we really do, it's more of a time-based maturing process that is allowing us to get more from the opportunities that we have.\nGary Kramer -- Chief Financial Officer\nYeah, I would just put some numbers around that. Our efficiency ratio is, right, for how we acquire clients is pretty consistent, whether it's California or all other geographies. We are growing quicker outside of California, but California is still adding more clients than outside of California and it's just -- and we get to California, it continues to grow and it's -- so we would like diluting the ocean because we've got such a big footprint in California.\nBill Dezellem -- Tieton Capital Management -- Analyst\nThank you. And then I do want to talk about claims frequency and then I'll -- then I'll be done here. You said claims frequency dropped to roughly 13%. What was behind that success?\nGary Kramer -- Chief Financial Officer\nYou know, I wish we could pinpoint to the one thing and do it over repetitively, but when you're doing these things, it's a lot of a little things. So we've got about 30 different strategies, and those 30 different strategies are yielding the favorable results that we're seeing. So it's not one thing we can pinpoint to, it's a lot of little things, but we feel very comfortable with where we are for the year for workers' comp, for claims coming in, for the value of the claims. We feel very comfortable about what we're seeing on the prior years, and you can see those results in the consistent redundancies that we have in the prior year loss picks.\nSo, the only thing I can say is we have a disciplined strategy and we are conservative and we are executing to that strategy. And then you start to see the conservatism unwind over time.\nMichael L. Elich -- President, Chief Executive Officer\nYeah, I would add that it's more of a systemic approach to all the things that we do from when we bring a new client on board to actually the level of retention that we have with the overall base and that the longer we do business with a client, the more apt they are to be better run companies and I think that's probably where we see one area that makes a big difference.\nBill Dezellem -- Tieton Capital Management -- Analyst\nSo were you serious, when you said 30 different things to improve the claims frequency?\nGary Kramer -- Chief Financial Officer\nWe have many tools in the box.\nBill Dezellem -- Tieton Capital Management -- Analyst\nSo is this just one of those examples where the business is being run much better from an operational perspective than it was several years ago and as part of this consistency that you referenced in your opening remarks, as part of what is going to lead to that consistency going forward?\nGary Kramer -- Chief Financial Officer\nI would say this that BBSI is better and I would say that the value that we're bringing to our client is better. So when you take the two, it becomes a multiplicative effect.\nBill Dezellem -- Tieton Capital Management -- Analyst\nGreat, thank you both for taking so many questions.\nMichael L. Elich -- President, Chief Executive Officer\nThank you.\nOperator\nThank you. At this time, this concludes our question-and-answer session. I'd like to turn the call back over to Mr. Elich for any closing remarks.\nMichael L. Elich -- President, Chief Executive Officer\nAgain, thank you for continuing on this journey with us. It's been very rewarding to see all the work that we've been putting into the organization over many years starting to pay some dividends and look forward to catching up with you both in the field and on the next call. Thank you, Bye.\nDuration: 51 minutes\nCall participants:\nGary Kramer -- Chief Financial Officer\nMichael L. Elich -- President, Chief Executive Officer\nChris Moore -- CJS Securities -- Analyst\nJeff Martin -- Roth Capital Partners -- Analyst\nJosh Vogel -- Sidoti & Company -- Analyst\nBill Dezellem -- Tieton Capital Management -- Analyst\nMore BBSI analysis\nAll earnings call transcripts\n\n\n\n\n"}
